Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/app-optimizer.po
Languages: fr

source: The Optimizer
fr: L'Optimizer

source: This section contains the documentation for AtmoSwing Optimizer. This document can also be downloaded as a pdf or epub using the bottom left menu.
fr: Cette section contient la documentation relative à AtmoSwing Optimizer. Ce document peut également être téléchargé au format pdf ou epub en utilisant le menu en bas à gauche.

source: The Optimizer manual is divided into the following topics:
fr: Le manuel de l'Optimizer est divisé en plusieurs rubriques :

source: Classic calibration
fr: Calibration classique

source: The calibration procedure that we call "sequential" or "classic" was elaborated by [Bontron2004]_ (see also [Radanovics2013]_ and [BenDaoud2016]_). It is a semi-automatic procedure that optimizes the spatial windows in which the predictors are compared and the number of analogs are systematically assessed for every level of analogy. The different analogy levels (e.g., the atmospheric circulation or moisture index) are calibrated sequentially. The procedure consists of the following steps [Bontron2004]_:
fr: La procédure de calibration que nous appelons "séquentielle" ou "classique" a été élaborée par [Bontron2004]_ (voir aussi [Radanovics2013]_ et [BenDaoud2016]_). Il s'agit d'une procédure semi-automatique qui optimise les fenêtres spatiales dans lesquelles les prédicteurs sont comparés, ainsi que le nombre d'analogues qui est évalué pour chaque niveau d'analogie. Les différents niveaux d'analogie (par exemple, la circulation atmosphérique ou l'indice d'humidité) sont calibrés séquentiellement. La procédure comprend les étapes suivantes [Bontron2004]_ :

source: Manual selection of the following parameters:
fr: Sélection manuelle des paramètres suivants :

source: Meteorological variable
fr: Variable météorologique

source: Pressure level
fr: Niveau de pression

source: Temporal window (hour of the day)
fr: Fenêtre temporelle (heure de la journée)

source: Number of analogs
fr: Nombre d'analogues

source: For every level of analogy:
fr: Pour chaque niveau d'analogie :

source: Identification of the most skilled unitary cell (four points for the geopotential height when using the S1 criteria and one point otherwise) of the predictor data over a large domain. Every point or cell of the full domain is assessed based on the predictors of the current level of analogy.
fr: Identification de la cellule unitaire la plus compétente (quatre points pour la hauteur géopotentielle lorsque l'on utilise le critère S1 et un point dans les autres cas) des données prédicteurs sur un vaste domaine. Chaque point ou cellule du domaine complet est évalué sur la base des prédicteurs du niveau d'analogie en cours.

source: From this most skilled cell, the spatial window is expanded by successive iterations in the direction of the most significant performance gain until no further improvement is possible (up to the user-specified maximum spatial window).
fr: À partir de la cellule la plus compétente, la fenêtre spatiale est élargie par itérations successives dans la direction du plus grand gain en performance jusqu'à ce qu'aucune amélioration supplémentaire ne soit possible (ou jusqu'à la fenêtre spatiale maximale spécifiée par l'utilisateur).

source: The number of analog situations Ni, which was initially set to an arbitrary value, is then reconsidered and optimized for the current level of analogy.
fr: Le nombre d'analogues Ni, qui a été initialement fixé à une valeur arbitraire, est ensuite reconsidéré et optimisé pour le niveau d'analogie en cours.

source: A new level of analogy can then be added based on other variables such as the moisture index at chosen pressure levels and hours of the day. The procedure starts again from step 2 (calibration of the spatial window and the number of analogs) for the new level. The parameters calibrated for the previous analogy levels are fixed and do not change.
fr: Un nouveau niveau d'analogie peut ensuite être ajouté sur la base d'autres variables telles que l'indice d'humidité à des niveaux de pression et des heures de la journée choisis. La procédure recommence à partir de l'étape 2 (calibrage de la fenêtre spatiale et du nombre d'analogues) pour le nouveau niveau. Les paramètres calibrés pour les niveaux d'analogie précédents sont fixes et ne changent pas.

source: Finally, the numbers of analogs for the different levels of analogy are reassessed. It is performed iteratively by varying the number of analogs of each level systematically.
fr: Enfin, les nombres d'analogues pour les différents niveaux d'analogie sont réévalués. Ceci est effectuée de manière itérative en faisant varier systématiquement le nombre d'analogues de chaque niveau.

source: The calibration is performed in successive steps for a limited number of parameters to minimize error functions or maximize skill scores. Except for the number of analogs, previously calibrated parameters are generally not reassessed. The benefit of this method is that it is relatively fast, it provides acceptable results, and it has low computing requirements.
fr: Le calage est effectué par étapes successives pour un nombre limité de paramètres afin de minimiser les fonctions d'erreur ou de maximiser les scores de vérification. À l'exception du nombre d'analogues, les paramètres précédemment calibrés ne sont généralement pas réévalués. L'avantage de cette méthode est qu'elle est relativement rapide, qu'elle fournit des résultats acceptables et qu'elle est peu exigeante en matière de resources de calcul.

source: Classic+ calibration
fr: Calibration classique+

source: Small improvements were incorporated into this method in AtmoSwing Optimizer, then termed as "classic+", by allowing the spatial windows to perform other moves, such as:
fr: De petites améliorations ont été incorporées à cette méthode dans AtmoSwing Optimizer, avec le nom "classique+", en permettant aux fenêtres spatiales d'effectuer d'autres mouvements, tels que :

source: an increase in 2 simultaneous directions,
fr: un agrandissement dans 2 directions simultanées,

source: a decrease in 1 or 2 simultaneous directions,
fr: une réduction dans 1 ou 2 directions simultanées,

source: an expansion or contraction (in every direction),
fr: une expansion ou une contraction (dans toutes les directions),

source: a shift of the window (without resizing) in 8 directions (including diagonals), and finally
fr: un déplacement de la fenêtre (sans redimensionnement) dans 8 directions (y compris les diagonales), et enfin

source: all the above, but with a factor of 2, 3, or more. For example, an increase by two grid points in one (or more) direction is assessed. It allows skipping one size that may not be optimal.
fr: tout ce qui précède, mais avec un facteur de 2, 3, ou plus. Par exemple, une augmentation de deux points de grille dans une (ou plusieurs) direction est évaluée. Cela permet de sauter une taille qui n'est peut-être pas optimale.

source: These additional steps often result in spatial windows that are slightly different. The performance gain is rather marginal for reanalyses with a low resolution such as NR-1, but might be more consistent for reanalyses with higher resolutions due to the presence of more local minima.
fr: Ces étapes supplémentaires aboutissent souvent à des fenêtres spatiales légèrement différentes. Le gain de performance est plutôt marginal pour les réanalyses à basse résolution telles que NR-1, mais pourrait être plus conséquent pour les réanalyses à plus haute résolution en raison de la présence de minima locaux.

source: Genetic algorithms
fr: Algorithmes génétiques

source: The sequential or classic calibration has substantial limitations: (i) it cannot automatically choose the pressure levels and temporal windows (hour of the day) for a given meteorological variable, (ii) it cannot handle dependencies between parameters, and (iii) it cannot easily handle new degrees of freedom. For this reason, genetic algorithms (GAs) were implemented in AtmoSwing Optimizer to perform a global optimization of AMs. It allows for the optimization of all parameters jointly in a fully automatic and objective way. See more details in [Horton2017]_.
fr: La calibration séquentielle ou classique présente des limites importantes : (i) elle ne peut pas choisir automatiquement les niveaux de pression et les fenêtres temporelles (heure de la journée) pour une variable météorologique donnée, (ii) elle ne peut pas gérer les dépendances entre les paramètres et (iii) elle ne peut pas facilement gérer de nouveaux degrés de liberté. C'est pourquoi des algorithmes génétiques (AG) ont été mis en œuvre dans AtmoSwing Optimizer pour réaliser une optimisation globale des MA. Cela permet d'optimiser tous les paramètres conjointement de manière entièrement automatique et objective. Voir plus de détails dans [Horton2017]_.

source: Genetic algorithms are powerful but very demanding in terms of computational capacity. They require thousands of assessments to evolve towards the global optimum and should thus be used on a cluster rather than a single computer.
fr: Les algorithmes génétiques sont puissants mais très exigeants en termes de capacité de calcul. Ils nécessitent des milliers d'évaluations pour évoluer vers l'optimum global et doivent donc être utilisés sur une grappe de serveurs (cluster) plutôt que sur un seul ordinateur.

source: Many options and operator variants are available for genetic algorithms. Based on systematic tests detailed in [Horton2017]_, some presets were established in order to ease the use of genetic algorithms in AtmoSwing Optimizer. These presets are listed below, and all options are provided further down.
fr: De nombreuses options et variantes d'opérateurs sont disponibles pour les algorithmes génétiques. Sur la base de tests systématiques détaillés dans [Horton2017]_, certaines présélections ont été établies afin de faciliter l'utilisation des algorithmes génétiques dans AtmoSwing Optimizer. Ces présélections sont listées ci-dessous, et toutes les options sont fournies plus loin.

source: General options
fr: Options générales

source: Some general options are provided below:
fr: Quelques options générales sont présentées ci-dessous :

source: The population size is the number of individuals in the population.
fr: La taille de la population est le nombre d'individus qui la composent.

source: The intermediate generation ratio is the ratio of individuals that are kept after natural selection.
fr: Le taux de la génération intermédiaire est le taux d'individus qui sont conservés après la sélection naturelle.

source: The convergence steps is the number of generations without improvement after which the algorithm stops.
fr: Les itérations pour la convergence sont le nombre de générations sans amélioration après lequel l'algorithme s'arrête.

source: The use of batches allows to reduce the computational time by using batches of data instead of the whole dataset.
fr: L'utilisation de lots (batches) permet de réduire le temps de calcul en utilisant des lots de données au lieu de l'ensemble des données.

source: The batch size is the number of days in each batch.
fr: La taille du lot (batch) est le nombre de jours dans chaque lot.

source: The number of epochs is the number of times the whole dataset is used for the optimization.
fr: Le nombre d'époques correspond au nombre de fois où l'ensemble des données est utilisé pour l'optimisation.

source: The batch size and the number of epochs are only used if batches are used (in which case the number of generations for convergence is not used).
fr: La taille du lot et le nombre d'époques ne sont utilisés que si l'approche pat lots est utilisée (auquel cas le nombre de générations pour la convergence n'est pas utilisé).

source: Size of the population (default 500)
fr: Taille de la population (par défaut 500)

source: Ratio of the intermediate generation (default 0.5)
fr: Ratio de la génération intermédiaire (par défaut 0.5)

source: Number of generations for convergence (default 30)
fr: Nombre de générations pour la convergence (par défaut 30)

source: Use batches
fr: Utiliser des lots (batches)

source: Size of the batches
fr: Taille des lots (batches)

source: Number of epochs if using batches
fr: Nombre d'époques si l'on utilise des lots (batches)

source: Operator options presets
fr: Présélections des opérateurs

source: Many options and operator variants control the optimization by genetic algorithms. Recommended configurations were predefined in presets.
fr: De nombreuses options et variantes d'opérateurs contrôlent l'optimisation par les algorithmes génétiques. Les configurations recommandées sont prédéfinies dans des présélections.

source: Operators presets
fr: Présélections des opérateurs

source: For all presets, the following options are identical: ``--ga-conv-steps=30`` ``--ga-pop-size=500`` ``--ga-interm-gen=0.5`` ``--ga-ope-nat-sel=0`` ``--ga-ope-coup-sel=2`` ``--ga-ope-cross=7`` ``--ga-cross-bin-pt-nb=2`` ``--ga-cross-bin-share-b=1``
fr: Pour toutes les présélections, les options suivantes sont identiques : ``--ga-conv-steps=30`` ``--ga-pop-size=500`` ``--ga-interm-gen=0.5`` ``--ga-ope-nat-sel=0`` ``--ga-ope-coup-sel=2`` ``--ga-ope-cross=7`` ``--ga-cross-bin-pt-nb=2`` ``--ga-cross-bin-share-b=1``

source: The difference between the presets concerns the mutation operator. Providing the following numbers (1-5) to the option ``--ga-config`` is equivalent to these corresponding presets:
fr: La différence entre les présélections concerne l'opérateur de mutation. Fournir les nombres suivants (1-5) à l'option ``--ga-config`` est équivalent à ces présélections correspondantes :

source: Chromosome of adaptive search radius: ``--ga-ope-mut=8``
fr: Chromosome du rayon de recherche adaptatif : ``--ga-ope-mut=8``

source: Multiscale mutation: ``--ga-ope-mut=9`` ``--ga-mut-multi-scale-p=0.1``
fr: Mutation multi-échelle : ``-ga-ope-mut=9`` ``ga-mut-multi-scale-p=0.1``

source: Nonuniform mutation (pmut=0.1, Gmr=50, w=0.1): ``--ga-ope-mut=4`` ``--ga-mut-non-uni-p=0.1`` ``--ga-mut-non-uni-gens=50`` ``--ga-mut-non-uni-min-r=0.1``
fr: Mutation non uniforme (pmut=0,1, Gmr=50, w=0,1) : ``--ga-ope-mut=4`` ``--ga-mut-non-uni-p=0.1`` ``--ga-mut-non-uni-gens=50`` ``--ga-mut-non-uni-min-r=0.1``

source: Nonuniform mutation (pmut=0.1, Gmr=100, w=0.1): ``--ga-ope-mut=4`` ``--ga-mut-non-uni-p=0.1`` ``--ga-mut-non-uni-gens=100`` ``--ga-mut-non-uni-min-r=0.1``
fr: Mutation non uniforme (pmut=0,1, Gmr=100, w=0,1) : ``--ga-ope-mut=4`` ``--ga-mut-non-uni-p=0.1`` ``--ga-mut-non-uni-gens=100`` ``--ga-mut-non-uni-min-r=0.1``

source: Nonuniform mutation (pmut=0.2, Gmr=100, w=0.1): ``--ga-ope-mut=4`` ``--ga-mut-non-uni-p=0.2`` ``--ga-mut-non-uni-gens=100`` ``--ga-mut-non-uni-min-r=0.1``
fr: Mutation non uniforme (pmut=0,2, Gmr=100, w=0,1) : ``--ga-ope-mut=4`` ``--ga-mut-non-uni-p=0.2`` ``--ga-mut-non-uni-gens=100`` ``--ga-mut-non-uni-min-r=0.1``

source: Any of these options can be overridden by specifying it along with ``--ga-config``.
fr: Chacune de ces options peut être modifiée en la spécifiant en addition de `--ga-config``.

source: Operator options
fr: Options du journal (log)

source: The different operators can be controlled with the following options:
fr: Les différents opérateurs peuvent être contrôlés avec les options suivantes :

source: Operator choice for natural selection:
fr: Choix de l'opérateur pour la sélection naturelle :

source: ratio elitism (default)
fr: ratio d'élitisme (par défaut)

source: tournament selection
fr: selection par tournoi

source: Operator choice for couples selection:
fr: Choix de l'opérateur pour la sélection des couples :

source: rank pairing
fr: appariement par rangs

source: random
fr: aléatoire

source: roulette wheel on rank (default)
fr: roulette sur le rang (par défaut)

source: roulette wheel on score
fr: roulette sur la base des scores

source: tournament competition
fr: tournoi de compétition

source: Operator choice for chromosome crossover:
fr: Choix de l'opérateur pour le croisement de chromosomes :

source: single point crossover
fr: croisement à point unique

source: double points crossover
fr: croisement à double point

source: multiple points crossover
fr: croisement à points multiples

source: uniform crossover
fr: croisement uniforme

source: limited blending
fr: mélange limité

source: linear crossover
fr: croisement linéaire

source: heuristic crossover
fr: croisement heuristique

source: binary-like crossover (default)
fr: croisement de type binaire (par défaut)

source: linear interpolation
fr: interpolation linéaire

source: free interpolation
fr: interpolation libre

source: Operator choice for mutation:
fr: Choix de l'opérateur pour la mutation :

source: random uniform constant
fr: aléatoire uniforme constante

source: random uniform variable
fr: variable aléatoire uniforme

source: random normal constant
fr: aléatoire normale constante

source: random normal variable
fr: variable normale aléatoire

source: non-uniform
fr: non uniforme

source: self-adaptation rate
fr: taux d'auto-adaptation

source: self-adaptation radius
fr: rayon d'auto-adaptation

source: self-adaptation rate chromosome
fr: chromosome de taux d'auto-adaptation

source: self-adaptation radius chromosome
fr: chromosome de rayon d'auto-adaptation

source: multi-scale
fr: multi-échelle

source: no mutation
fr: pas de mutation

source: Natural selection - tournament probability (default 0.9)
fr: Sélection naturelle - probabilité de tournoi (par défaut 0.9)

source: Couples selection - tournament candidates (2/3) (default 3)
fr: Sélection des couples - candidats au tournoi (2/3) (par défaut 3)

source: Standard crossover - number of points (default 3)
fr: Croisement standard - nombre de points (par défaut 3)

source: Blending crossover - number of points (default 3)
fr: Croisement par mélange (Blending crossover) - nombre de points (par défaut 3)

source: Blending crossover - beta shared (1/0) (default 1)
fr: Croisement par mélange (Blending crossover) - bêta partagé (1/0) (par défaut : 1)

source: Linear crossover - number of points (default 2)
fr: Croisement linéaire - nombre de points (par défaut 2)

source: Heuristic crossover - number of points (default 2)
fr: Croisement heuristique - nombre de points (par défaut 2)

source: Heuristic crossover - beta shared (1/0) (default 1)
fr: Croisement heuristique - bêta partagé (1/0) (par défaut 1)

source: Binary-like crossover - number of points (default 2)
fr: Croisement de type binaire - nombre de points (par défaut 2)

source: Binary-like crossover - beta shared (1/0) (default 1)
fr: Croisement de type binaire - bêta partagé (1/0) (par défaut : 1)

source: Uniform mutation - probability (default 0.2)
fr: Mutation uniforme - probabilité (par défaut 0.2)

source: Normal mutation - probability (default 0.2)
fr: Mutation normale - probabilité (par défaut 0.2)

source: Normal mutation - standard deviation (default 0.1)
fr: Mutation normale - écart-type (par défaut 0.1)

source: Variable uniform mutation - generations nb (default 50)
fr: Mutation uniforme variable - nb de générations (par défaut 50)

source: Variable uniform mutation - starting probability (default 0.5)
fr: Mutation uniforme variable - probabilité de départ (par défaut 0.5)

source: Variable uniform mutation - end probability (default 0.01)
fr: Mutation uniforme variable - probabilité de fin (par défaut 0.01)

source: Variable normal mutation - generations nb for probability (default 50)
fr: Mutation uniforme variable - nb de générations pour la probabilité (par défaut 50)

source: Variable normal mutation - generations nb for std deviation (default 50)
fr: Mutation uniforme variable - nb de générations pour l'écart-type (par défaut 50)

source: Variable normal mutation - starting probability (default 0.5)
fr: Mutation uniforme variable - probabilité de départ (par défaut 0.5)

source: Variable normal mutation - end probability (default 0.05)
fr: Mutation uniforme variable - probabilité de fin (par défaut 0.05)

source: Variable normal mutation - starting std deviation (default 0.5)
fr: Mutation uniforme variable - écart-type de départ (par défaut 0.5)

source: Variable normal mutation - end std deviation (default 0.01)
fr: Mutation uniforme variable - écart-type final (par défaut 0.01)

source: Non uniform mutation - probability (default 0.1-0.2)
fr: Mutation non uniforme - probabilité (par défaut 0.1-0.2)

source: Non uniform mutation - generations nb (default 50-100)
fr: Mutation non uniforme - nb de générations (par défaut 50-100)

source: Non uniform mutation - minimum rate (default 0.1)
fr: Mutation non uniforme - taux minimum (par défaut 0.1)

source: Multi-scale mutation - probability (default 0.1)
fr: Mutation multi-échelle - probabilité (par défaut 0.1)

source: Optimizer parameters file
fr: Fichier de paramètres de l'Optimizer

source: The Optimizer has two different kinds of parameter files. One type for the classic and classic+ calibration (see `Classic calibration parameters file`_) and another for the optimization techniques using genetic algorithms or Monte-Carlo simulations (see `optimization parameters file`_). However, some attributes are identical for both of them.
fr: L'Optimizer dispose de deux types de fichiers de paramètres. Un type pour la calibration classique et classique+ (voir `Fichier de paramètres de calibration classique`_) et un autre pour les techniques d'optimisation utilisant des algorithmes génétiques ou des simulations de Monte-Carlo (voir `Fichier de paramètres d'optimisation`_). Cependant, certains attributs sont identiques pour les deux.

source: Shared properties
fr: Propriétés partagées

source: Content 'time_properties'
fr: Contenu 'time_properties'

source: The content of ``<time_properties>`` is globally similar to the :ref:`standard parameters file<parameters-file>`, to the exception of a ``<calibration_period>`` and a ``<validation_period>`` element.
fr: Le contenu de ``<time_properties>`` est globalement similaire au :ref:`fichier de paramètres standard<parameters-file>`, à l'exception d'un élément ``<calibration_period>`` et d'un élément ``<validation_period>``.

source: Element 'calibration_period'
fr: Élément 'calibration_period'

source: The content of ``<calibration_period>`` defines the target period on which the method is trained. It works as the ``<archive_period>`` element. Two options are possible:
fr: Le contenu de ``<calibration_period>`` définit la période cible sur laquelle la méthode est entraînée. Il fonctionne comme l'élément ``<archive_period>``. Deux options sont possibles :

source: Providing the exact dates:
fr: En fournissant les dates exactes :

source: ``<start>``: Start of the calibration period (ex: 01.01.1981)
fr: ``<start>`` : Début de la période de calibration (ex : 01.01.1981)

source: ``<end>``: End of the calibration period (ex: 31.12.2010)
fr: ``<end>`` : Fin de la période de calibration (ex : 31.12.2010)

source: Alternatively, only providing the years:
fr: Il est également possible de ne fournir que les années :

source: ``<start_year>``: Start of the calibration period (ex: 1981)
fr: ``<start_year>`` : Début de la période de calibration (ex : 1981)

source: ``<end_year>``: End of the calibration period (ex: 2010)
fr: ``<end_year>`` : Fin de la période de calibration (ex : 2010)

source: Element 'validation_period'
fr: Élément 'validation_period'

source: The content of ``<validation_period>`` defines the independent period that is reserved for validation.
fr: Le contenu de ``<validation_period>`` définit la période indépendante qui est réservée à la validation.
