Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/app-optimizer.po
Languages: fr

source: A text file with the resulting best parameters set and the skill score ([...]best_parameters.txt).
fr: Un fichier texte avec le meilleur jeu de paramètres résultant et le score de vérification ([...]best_parameters.txt).

source: A text file with all the assessed parameters set and their corresponding skill score ([...]tested_parameters.txt).
fr: Un fichier texte contenant tous les paramètres évalués et leur score de vérification correspondant ([...]tested_parameters.txt).

source: An xml file with the best parameters set (to be used further by AtmoSwing Forecaster/Downscaler; [...]best_parameters.xml).
fr: Un fichier xml avec les meilleurs paramètres (à utiliser par AtmoSwing Forecaster/Downscaler ; [...]best_parameters.xml).

source: A NetCDF file containing the analog dates (AnalogDates[...].nc) both for the calibration and validation periods.
fr: Un fichier NetCDF contenant les dates analogues (AnalogDates[...].nc) pour les périodes de calibration et de validation.

source: A NetCDF file containing the analog values (AnalogValues[...].nc) both for the calibration and validation periods.
fr: Un fichier NetCDF contenant les valeurs analogues (AnalogValues[...].nc) pour les périodes de calibration et de validation.

source: A NetCDF file containing the skill scores (Scores[...].nc) both for the calibration and validation periods.
fr: Un fichier NetCDF contenant les scores de vérification (Scores[...].nc) pour les périodes de calibration et de validation.

source: Graphical user interface
fr: Interface utilisateur graphique

source: The main interface of the Optimizer is as follows.
fr: L'interface principale de l'Optimizer est la suivante.

source: The toolbar allows the following actions:
fr: La barre d'outils permet d'effectuer les actions suivantes :

source: |icon_run| Start the optimization.
fr: |icon_run| Démarrer l'optimisation.

source: |icon_stop| Stop the current calculations.
fr: |icon_stop| Arrêter les calculs en cours.

source: |icon_preferences| Define the preferences.
fr: |icon_preferences| Définir les préférences.

source: What is needed:
fr: Éléments nécessaires :

source: Select one of the `calibration methods`_
fr: Sélectionnez une des `méthodes de calibration`_

source: :ref:`The parameters file <parameters-file-optimizer>`
fr: :ref:`Le fichier de paramètres pour la calibration<parameters-file-optimizer>`

source: :ref:`The predictand database <predictand-db>`
fr: :ref:`Une base de données de prédictants <predictand-db>`

source: The directory containing the :ref:`predictors for the archive period <reanalyses>`
fr: Le répertoire contenant les :ref:`prédicteurs pour la période d'archive <reanalyses>`

source: The directory to save the results
fr: Le répertoire pour sauvegarder les résultats

source: All the options for the selected calibration method (in the Options tab; see below)
fr: Toutes les options de la méthode de calibration sélectionnée (dans l'onglet Options ; voir ci-dessous)

source: There is one tab to define the options of the classic calibration, the variables exploration, and the Monte-Carlo simulations. The details of the options are given :ref:`here<classic-calibration>`.
fr: Un onglet permet de définir les options de la calibration classique, de l'exploration des variables et des simulations de Monte-Carlo. Les détails des options sont donnés :ref:`ici<classic-calibration>`.

source: The other tab provides numerous options for genetic algorithms. The details of the options are given on the page of the :ref:`genetic algorithms <genetic-algorithms>`.
fr: L'autre onglet fournit de nombreuses options pour les algorithmes génétiques. Le détail des options est donné sur la page des :ref:`algorithmes génétiques <genetic-algorithms>`.

source: Command line interface
fr: Interface en ligne de commande

source: The Optimizer also has a command line interface, which is the prefered way of using it. The options are as follows:
fr: L'Optimizer dispose également d'une interface en ligne de commande, qui est le mode d'utilisation préférable. Les options sont les suivantes :

source: Displays the help of command line options
fr: Afficher l'aide des options en ligne de commande

source: Displays the software version
fr: Afficher la version du logiciel

source: Silent mode
fr: Mode silencieux

source: Work in local directory
fr: Travail dans le répertoire local

source: Number of threads to use
fr: Nombre de threads à utiliser

source: Number of gpus to use
fr: Nombre de gpus à utiliser

source: A given run number
fr: Un numéro pour le run

source: File containing the parameters
fr: Fichier contenant les paramètres

source: The predictand DB
fr: La base de données des prédictants

source: The predictand station ID
fr: L'ID de la station du prédictant

source: The predictors directory
fr: Le répertoire des prédicteurs

source: Skip the validation calculation
fr: Sauter le calcul de validation

source: Do not allow to keep several times the same analog dates (e.g. for ensembles)
fr: Ne pas permettre de garder plusieurs fois les mêmes dates analogues (par exemple pour les ensembles)

source: Dump predictor data to binary files to reduce RAM usage
fr: Décharge les données du prédicteur dans des fichiers binaires pour réduire l'utilisation de la RAM

source: Load dumped predictor data into RAM (faster load)
fr: Chargement des données déchargées (binaires) du prédicteur dans la RAM (chargement plus rapide)

source: Option to replace NaNs with -9999 (faster processing)
fr: Option pour remplacer les NaN par -9999 (traitement plus rapide)

source: Do not check for NaNs (faster processing)
fr: Ne pas vérifier les NaN (traitement plus rapide)

source: Choice of the calibration method:
fr: Choix de la méthode de calibration :

source: ``single``: single assessment
fr: ``single`` : évaluation unique

source: ``classic``: classic calibration
fr: ``classic`` : calibration classique

source: ``classicp``: classic+ calibration
fr: ``classicp`` : calibration classique+

source: ``varexplocp``: variables exploration classic+
fr: ``varexplocp`` : exploration des variables avec classique+

source: ``montecarlo``: Monte Carlo
fr: ``montecarlo`` : Simulations de Monte Carlo

source: ``ga: genetic``: algorithms
fr: ``ga`` : algorithms génétiques

source: ``evalscores``: evaluate all scores
fr: ``evalscores`` : évalue tous les scores

source: ``onlyvalues``: evaluate all scores
fr: ``onlyvalues`` : calcule uniquement les valeurs analogues

source: ``onlydates``: evaluate all scores
fr: ``onlydates`` : calcule uniquement les dates analogues

source: Classic plus: resizing iteration
fr: Classique+ : itération de redimensionnement

source: Classic plus: steps in latitudes for the relevance map
fr: Classique+ : pas (résolution) en latitudes pour la carte de pertinence

source: Classic plus: steps in longitudes for the relevance map
fr: Classique+ : pas (résolution) en longitudes pour la carte de pertinence

source: Classic plus: proceed sequentially
fr: Classique+ : procéder de manière séquentielle

source: Variables exploration: step to process
fr: Exploration des variables : étape à traiter

source: Monte Carlo: number of runs
fr: Monte Carlo : nombre de simulations

source: All GAs options are described on the :ref:`genetic algorithms <genetic-algorithms>` page
fr: Toutes les options des GAs sont décrites sur la page des :ref:`algorithms génétiques <genetic-algorithms>`

source: Set the log level (0: minimum, 1: errors, 2: warnings (default), 3: verbose)
fr: Définir le niveau du journal (0 : minimum, 1 : erreurs, 2 : avertissements (par défaut), 3 : verbeux)

source: Verification scores
fr: Scores de vérification

source: The Optimizer has different verification scores implemented. The most often used for precipitation is the CRPS. The options are:
fr: L'Optimizer dispose de différents scores de vérification. Le plus souvent utilisé pour les précipitations est le CRPS. Les options sont les suivantes :

source: CRPSS (Continuous ranked probability skill score): ``CRPSS``
fr: CRPSS (Score de compétence du CRPS) : ``CRPSS``

source: CRPS (Continuous ranked probability score): ``CRPS``
fr: Indice continu de probabilité ordonnée CRPS (Continuous ranked probability score) : ``CRPS``

source: CRPS accuracy: ``CRPSaccuracy``
fr: Précision du CRPS : ``CRPSaccuracy``

source: CRPS sharpness: ``CRPSsharpness``
fr: Netteté du CRPS : ``CRPSsharpness``

source: CRPS reliability: ``CRPSreliability``
fr: Fiabilité du CRPS : ``CRPSreliability``

source: CRPS potential: ``CRPSpotential``
fr: Potentiel du CRPS: ``CRPSpotential``

source: Absolute difference of the frequency of null values: ``DF0``
fr: Différence absolue de la fréquence des valeurs nulles : ``DF0``

source: Proportion correct (contingency table): ``PC``
fr: Proportion correcte (tableau de contingence) : ``PC``

source: Threat score (contingency table): ``TS``
fr: Score de menace ("Threat score", tableau de contingence) : ``TS``

source: Bias (contingency table): ``BIAS``
fr: Biais (tableau de contingence) : ``BIAS``

source: False alarm ratio (contingency table): ``FARA``
fr: Rapport de fausses alarmes ("False alarm ratio", tableau de contingence) : ``FARA``

source: Hit rate (contingency table): ``H``
fr: Taux de réussite ("Hit rate", tableau de contingence) : ``H``

source: False alarm rate (contingency table): ``F``
fr: Taux de fausses alarmes ("False alarm rate", tableau de contingence) : ``F``

source: Heidke skill score (contingency table): ``HSS``
fr: Score de compétence de Heidke ("Heidke skill score", tableau de contingence) : ``HSS``

source: Pierce skill score (contingency table): ``PSS``
fr: Score de compétence de Pierce ("Pierce skill score", tableau de contingence) : ``PSS``

source: Gilbert skill score (contingency table): ``GSS``
fr: Score de compétence Gilbert ("Gilbert skill score", tableau de contingence) : ``GSS``

source: Mean absolute error: ``MAE``
fr: Erreur absolue moyenne : ``MAE``

source: Mean squared error: ``MSE``
fr: Erreur quadratique moyenne : ``MSE``

source: Root mean squared error: ``RMSE``
fr: Racine de l'erreur quadratique Moyenne ("Root mean squared error") : ``RMSE``

source: Brier score: ``BS``
fr: Score de Brier ("Brier score") : ``BS``

source: Brier skill score: ``BSS``
fr: Score de compétence Brier : ``BSS``

source: Stable equitable error in probability space: ``SEEPS``
fr: Erreur équitable stable dans l'espace de probabilité ("Stable equitable error in probability space") : ``SEEPS``

source: The Verification Rank Histogram (Talagrand Diagram): ``RankHistogram``
fr: L'histogramme des rangs (diagramme de Talagrand) : ``RankHistogram``

source: Reliability of the Verification Rank Histogram (Talagrand Diagram): ``RankHistogramReliability``
fr: Fiabilité de l'histogramme des rangs (diagramme de Talagrand) : ``RankHistogrammeReliability``
