Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/app-forecaster.po
Languages: fr

source: The Forecaster
fr: Le Forecaster

source: This section contains the documentation for AtmoSwing Forecaster. This document can also be downloaded as a pdf or epub using the bottom left menu.
fr: Cette section contient la documentation relative à AtmoSwing Forecaster. Ce document peut également être téléchargé au format pdf ou epub en utilisant le menu en bas à gauche.

source: The Forecaster manual is divided into the following topics:
fr: Le manuel du Forecaster est divisé en plusieurs rubriques :

source: Forecaster parameters file
fr: Fichier de paramètres du Forecaster

source: The parameters files for the Forecaster are based on the :ref:`generic parameters file for AtmoSwing<parameters-file>`, but has some specific elements for the operational forecasting as detailed below. A :ref:`full example<Full example>` is provided at the bottom of the page.
fr: Les fichiers de paramètres pour le Forecaster sont basés sur le :ref:`fichier de paramètres générique pour AtmoSwing<parameters-file>`, mais comportent des éléments spécifiques pour la prévision opérationnelle, comme détaillé ci-dessous. Un :ref:`exemple complet<Full example>` est fourni en bas de page.

source: Root node
fr: Nœud racine

source: The ``target`` property of the root node needs to be ``forecaster``.
fr: La propriété ``target`` du nœud racine doit être ``forecaster``.

source: Content 'time_properties'
fr: Contenu 'time_properties'

source: The ``<time_properties>`` property has no ``<time_array_target>`` element, but a ``<lead_time_days>`` element listing the lead times (in days) to process.
fr: La propriété ``<time_properties>`` n'a pas d'élément ``<time_array_target>``, mais un élément ``<lead_time_days>`` listant les échéances (en jours) à calculer.

source: Content 'analog_dates'
fr: Contenu 'analog_dates'

source: The content of ``<analog_dates>`` is mostly similar to the basic parameters file structure. The differences are:
fr: Le contenu de ``<analog_dates>`` est en grande partie similaire à la structure du fichier des paramètres de base. Les différences sont les suivantes :

source: ``<analogs_number>``: The number of analogs to extract is not a single number as in the generic parameters file, but one value has to be provided for each lead time. The number of analogs to extract can thus increase with the lead time to take into account the increasing uncertainty of the NWP outputs.
fr: ``<analogs_number>`` : Le nombre d'analogues à extraire n'est pas un nombre unique comme dans le fichier de paramètres de base, mais une valeur doit être fournie pour chaque échéance. Le nombre d'analogues à extraire peut donc augmenter avec l'échéance pour tenir compte de l'incertitude croissante des sorties de la PNT.

source: For the operational forecasting, two predictor datasets are needed: the NWP outputs and the archive dataset:
fr: Pour la prévision opérationnelle, deux ensembles de données prédicteurs sont nécessaires : les sorties de la PNT et les données d'archive :

source: ``<realtime_dataset_id>``: NWP outputs dataset
fr: ``<realtime_dataset_id>`` : Jeu de données des sorties PNT (NWP)

source: ``<realtime_data_id>``: Name of the variable in the NWP outputs dataset
fr: ``<realtime_data_id>`` : Nom de la variable dans le jeu de données des sorties PNT

source: ``<archive_dataset_id>``: Archive dataset
fr: ``<archive_dataset_id>`` : Jeu de données d'archive

source: ``<archive_data_id>``: Name of the variable in the archive dataset
fr: ``<archive_data_id>`` : Nom de la variable dans les données d'archive

source: Full example
fr: Exemple complet

source: Example of a parameters file for the Forecaster:
fr: Exemple d'un fichier de paramètres pour le Forecaster :

source: Preferences
fr: Préférences

source: The preferences frame can be opened from the menu Options / Preferences of the main interface or with a button from the toolbar. The options related to the batch file are saved in the batch file itself, while the other options are saved in the user preferences file. The preferences are saved when the software is closed. The preferences are automatically loaded when the software is started. AtmoSwing will first look for a preference file in the same directory as the executable, then in the user directory.
fr: La fenêtre des préférences peut être ouvert à partir du menu Options / Préférences de l’interface principale ou à l’aide d’un bouton de la barre d’outils. Les options liées au fichier batch sont sauvegardées dans le fichier batch lui-même, tandis que les autres options sont sauvegardées dans le fichier de préférences de l'utilisateur. Les préférences sont sauvegardées à la fermeture du logiciel et sont automatiquement chargées au démarrage du logiciel. AtmoSwing cherchera d'abord un fichier de préférences dans le même répertoire que l'exécutable, puis dans le répertoire de l'utilisateur.

source: Batch file properties
fr: Propriétés du fichier batch

source: Different directories must be specified for operational forecasting:
fr: Différents répertoires doivent être spécifiés pour les prévisions opérationnelles :

source: Directory containing the parameters files: contains the :ref:`xml parameters files (defining by the method parameters)<parameters-file-forecaster>`
fr: Répertoire contenant les fichiers de paramètres : contient les :ref:`fichiers de paramètres xml (définis par les paramètres de la méthode)<parameters-file-forecaster>`

source: Directory containing the predictand DB: contains the :ref:`NetCDF file generated from the predictand data<predictand-db>`.
fr: Répertoire contenant la base de données des prédictants : contient le :ref:`fichier NetCDF généré à partir des données des prédictants<predictand-db>`.

source: Directory containing the archive predictors: predictor describing the candidate situations (for example :ref:`reanalyses<reanalyses>`).
fr: Répertoire contenant les archives de prédicteurs : prédicteur décrivant les situations candidates (par exemple :ref:`réanalyses<reanalyses>`).

source: Directory to save downloaded real-time predictors: the operational NWP model outputs. Subdirectories are automatically created for each date according to a year/month/day structure (respectively \\ on Windows).
fr: Répertoire pour enregistrer les variables prédicteurs prévues : les sorties du modèle PNT (NWP) opérationnel. Des sous-répertoires sont automatiquement créés pour chaque date selon une structure année/mois/jour (respectivement \\ sous Windows).

source: Directory to save the forecast outputs (NetCDF): location where the results are stored. Subdirectories are also generated for each date.
fr: Répertoire pour enregistrer les sorties de la prévision (NetCDF) : emplacement où les résultats sont stockés. Des sous-répertoires sont également générés pour chaque date.

source: Directory to save the forecast exports (xml/csv): location where the synthesis xml file is saved.
fr: Répertoire pour enregistrer des exportations de prévisions (xml/csv) : emplacement où le fichier xml de synthèse est enregistré.

source: In addition, the export format can be selected (for example, full XML or small CSV).
fr: En outre, le format d'exportation peut être sélectionné (par exemple, XML complet ou CSV réduit).

source: General options
fr: Options générales

source: Language
fr: Langue

source: The language can be changed from the drop-down list. The change is effective after restarting the software.
fr: La langue peut être modifiée à partir de la liste déroulante. Le changement est effectif après le redémarrage du logiciel.

source: Log options
fr: Options du journal (log)

source: Log preferences control the display of the log window and the level (importance) of reported messages:
fr: Les préférences de journal contrôlent l'affichage de la fenêtre de journal et le niveau (importance) des messages rapportés :

source: Errors only - recommended as long as everything goes as planned.
fr: Erreurs uniquement - recommandé tant que tout se passe comme prévu.

source: Errors and warnings - some warnings help to be vigilant in case of problems. However, there might be warnings even during regular operation.
fr: Erreurs et avertissements - certains avertissements permettent d'être vigilant en cas de problème. Cependant, il peut y avoir des avertissements même pendant un fonctionnement normal.

source: Verbose - all operations are reported, which is an unnecessary amount of information during regular operation. As a result, important messages might be hidden in a large number of messages. This option is only useful to identify where AtmoSwing is failing.
fr: Verbose - toutes les opérations sont signalées, ce qui représente une quantité inutile d’informations lors d’une opération régulière. Par conséquent, des messages importants peuvent être cachés dans un grand nombre de messages. Cette option n’est utile que pour identifier les endroits où AtmoSwing rencontre des problèmes.

source: Internet proxy
fr: Proxy Internet

source: The proxy configuration contains the following elements:
fr: La configuration du proxy contient les éléments suivants :

source: Proxy activation - if necessary.
fr: Activation du proxy - si nécessaire.

source: Proxy properties - the proxy address, port, the user name, and password.
fr: Propriétés du proxy - l'adresse du proxy, le port, le nom d'utilisateur et le mot de passe.

source: Libraries options
fr: Options des librairies

source: The path to the ecCodes definitions can be specified. These files are used to decode the GRIB files. The default path is automatically set during installation.
fr: Le chemin d'accès aux définitions d'ecCodes peut être spécifié. Ces fichiers sont utilisés pour décoder les fichiers GRIB. Le chemin par défaut est automatiquement défini lors de l'installation.

source: Advanced options
fr: Options avancées

source: The advanced options are automatically configured and usually do not need to be changed.
fr: Les options avancées sont configurées automatiquement et n'ont généralement pas besoin d'être modifiées.

source: Graphical User Interface (GUI) options
fr: Options de l'interface utilisateur graphique (GUI)

source: Options to control the behavior of the interface and its means of communication with the user. Saves calculation time by disabling dialog boxes. The choices are:
fr: Options permettant de contrôler le comportement de l'interface et ses moyens de communication avec l'utilisateur. Permet de gagner du temps de calcul en désactivant les boîtes de dialogue. Les choix sont les suivants :

source: Silent - no dialog box is displayed. The user must, therefore, keep an eye on the log window to detect any error. This option is only useful for very intensive calculations.
fr: Silencieux - aucune boîte de dialogue n'est affichée. L'utilisateur doit donc garder un œil sur la fenêtre de journal pour détecter toute erreur. Cette option n'est utile que pour les calculs très intensifs.

source: Standard - recommended for regular use.
fr: Standard - recommandé pour une utilisation régulière.

source: Verbose - a bit more verbose than the Standard option.
fr: Verbose - un peu plus verbeux que l'option Standard.

source: Predictor download
fr: Téléchargement des prédicteurs

source: Options for automatic predictor download. The "maximum number of previous time steps if the download fails" corresponds to the number of attempts to retrieve data issued earlier if the desired data cannot be downloaded; this number must be greater than 2 to ensure proper operation of the Forecaster. Indeed, the latest NWP outputs are never instantly accessible, but after a certain delay. In this case, the most recent available data must be used.
fr: Options pour le téléchargement automatique du prédicteur. Le "nombre maximum de pas de temps précédents si le téléchargement échoue" correspond au nombre de tentatives de récupération des données émises précédemment si les données souhaitées ne peuvent pas être téléchargées ; ce nombre doit être supérieur à 2 pour assurer le bon fonctionnement du Forecaster. En effet, les dernières sorties de la PNT ne sont jamais accessibles instantanément, mais après un certain délai. Dans ce cas, les données disponibles les plus récentes doivent être utilisées.

source: Different options can control the software's behavior:
fr: Différentes options permettent de contrôler le comportement du logiciel :

source: Enable or disable the reactivity of the graphical interface. This option must always be enabled for regular use.
fr: Activer ou désactiver la réactivité de l'interface graphique. Cette option doit toujours être activée pour une utilisation régulière.

source: Allow multiple instances of the Forecaster.
fr: Autoriser les instances multiples du Forecaster.

source: Options for using multiple threads:
fr: Options pour l'utilisation de plusieurs threads :

source: Allow multithreading - allows a gain in performance for the calculations (recommended).
fr: Autoriser le multithreading - permet un gain de performance pour les calculs (recommandé).

source: Maximum number of threads - to be chosen according to the computer's CPU. The software automatically proposes the optimal number of threads for the computer in use.
fr: Nombre maximal de threads - à choisir en fonction du CPU de l'ordinateur. Le logiciel propose automatiquement le nombre optimal de threads pour l'ordinateur utilisé.

source: Threads priority - allows defining the priority of the threads in competition with other ongoing processes.
fr: Priorité des threads - permet de définir la priorité des threads en compétition avec les autres processus en cours.

source: Processing options
fr: Options de calculs

source: These options influence how the search for analogs is performed, which has no impact on the results, only on the calculation time. The choices are as follows:
fr: Ces options influencent la manière dont la recherche d'analogues est effectuée, ce qui n'a aucun impact sur les résultats, mais uniquement sur le temps de calcul. Les choix sont les suivants :

source: Multithreaded - as long as the computer has at least two processors. It is the fastest version.
fr: Multithreaded - pour autant que l'ordinateur possède au moins deux processeurs. Il s'agit de la version la plus rapide.

source: Standard - this option is slower than the previous one as it uses a single thread.
fr: Standard - cette option est plus lente que la précédente car elle utilise un seul thread.

source: User specific paths
fr: Chemins d'accès spécifiques à l'utilisateur

source: Some paths automatically defined according to the OS: working directory, log file, and preferences file.
fr: Certains chemins sont définis automatiquement en fonction du système d'exploitation : le répertoire de travail, le fichier journal et le fichier de préférences.

source: Usage
fr: Utilisation

source: The Forecaster allows processing an analog method based on the latest available NWP outputs or for a given date. The real-time forecast calculation can be performed by a standard computer without specific resources. The forecast can be executed on demand through a graphical user interface (GUI) or can be automated through the use of a command-line interface (CLI). Both aspects are explained hereafter.
fr: Le Forecaster permet de calculer une méthode d'analogues basée sur les dernières sorties PNT (NWP) disponibles ou pour une date donnée. Le calcul de la prévision en temps réel peut être effectué par un ordinateur standard sans ressources spécifiques. La prévision peut être exécutée à la demande par le biais d'une interface utilisateur graphique (GUI) ou peut être automatisée par l'utilisation d'une interface en ligne de commande (CLI). Ces deux aspects sont expliqués ci-après.

source: By default, the Forecaster processes the latest available forecast. However, it can also process a forecast for a given day in the past, provided the NWP outputs are available locally or remotely, or it can be executed to process the last x days. These options can also be executed once a day by a task manager to fill eventual gaps in the previous days. If the forecasts are already present, no computing resources are used.
fr: Par défaut, le Forecaster traite la dernière prévision disponible. Cependant, il peut également calculer une prévision pour un jour donné dans le passé, à condition que les sorties PNT (NWP) soient disponibles localement ou à distance, ou il peut être exécuté pour traiter les x derniers jours. Ces options peuvent également être exécutées une fois par jour par un gestionnaire de tâches pour combler d'éventuelles lacunes dans les jours précédents. Si les prévisions sont déjà présentes, aucune ressource informatique n'est utilisée.

source: A batch file can be provided to the GUI or the CLI. It contains the data and export paths as well as the analog methods to be applied (defined themselves in the xml parameter files). Automatic tasks can thus execute the Forecaster successively with different options, for example, for different regions. The results can be saved in different directories, or the same ones.
fr: Un fichier batch peut être fourni à l'interface graphique (GUI) ou en ligne de commande (CLI). Il contient les chemins des données et d'exportation ainsi que les méthodes d'analogues à appliquer (définies dans les fichiers de paramètres xml). Des tâches automatiques peuvent ainsi exécuter successivement le Forecaster avec différentes options, par exemple pour différentes régions. Les résultats peuvent être optionellement sauvegardés dans différents répertoires.

source: Requirements
fr: Exigences

source: The Forecaster needs:
fr: Le Forecaster a besoin :

source: :ref:`A predictand database <predictand-db>`
fr: :ref:`Une base de données de predictands <predictand-db>`

source: :ref:`Operational predictors from NWP outputs <data-forecaster>`
fr: :ref:`Prédicteurs prévus à partir des sorties PNT (NWP) <data-forecaster>`

source: :ref:`A predictors archive (e.g. a reanalysis dataset) <reanalyses>`
fr: :ref:`Une archive de prédicteurs (par exemple un jeu de données de réanalyse) <reanalyses>`

source: :ref:`Parameters files defining the properties of the method. <parameters-file-forecaster>`
fr: :ref:`Fichiers de paramètres définissant les propriétés de la méthode. <parameters-file-forecaster>`

source: Outputs
fr: Sorties

source: The Forecaster produces compressed **NetCDF files** containing:
fr: Le Forecaster produit des **fichiers NetCDF** compressés contenant :

source: The values of the predictand for the different lead times
fr: Les valeurs du prédicand pour les différentes échéances d'exécution

source: The analog dates
fr: Les dates analogues

source: The values of the analogy criteria
fr: Les valeurs des critères d'analogie

source: The target dates (lead times)
fr: Les dates cibles (échéances)

source: The number of analogs for the different lead times
fr: Le nombre d'analogues pour les différentes échéances

source: Some reference values (e.g., precipitation for different return periods)
fr: Quelques valeurs de référence (par exemple, les précipitations pour différentes périodes de retour)

source: Some station metadata (ID, name, coordinates, height)
fr: Quelques métadonnées de la station (ID, nom, coordonnées, altitude)

source: Some information about the predictors used along with the spatial windows
fr: Quelques informations sur les prédicteurs utilisés ainsi que sur les fenêtres spatiales

source: There is one file per variant of the analog method containing data for all stations of the database.
fr: Il existe un fichier par variante de la méthode des analogues contenant les données de toutes les stations de la base de données.

source: Some **exports** can also be generated (e.g. synthetic xml or csv files) to ease the integration of synthetic data on a web platform, for example.
fr: Certains **exports** peuvent également être générés (par exemple, des fichiers synthétiques xml ou csv) pour faciliter l'intégration de données synthétiques sur une plateforme web, par exemple.

source: The files are saved in a date-based directory structure (for example, 2019/04/23). The Viewer follows the same rules to look for new forecasts automatically. The output directory can be synchronized by means of a file-sharing client to distribute the forecasts.
fr: Les fichiers sont enregistrés dans une structure de répertoire basée sur la date (par exemple, 2019/04/23). Le Viewer suit les mêmes règles pour rechercher automatiquement les nouvelles prévisions. Le répertoire de sortie peut être synchronisé à l'aide d'un client de partage de fichiers pour distribuer les prévisions.

source: Graphical user interface
fr: Interface utilisateur graphique

source: This tool allows to do the following actions:
fr: Cet outil permet d'effectuer les actions suivantes :

source: Process the latest forecast or for a given date
fr: Traiter la dernière prévision ou pour une date donnée

source: Define the list of methods to be performed automatically (also in command line mode)
fr: Définir la liste des méthodes à exécuter automatiquement (également en mode ligne de commande)

source: The toolbar allows the following actions:
fr: La barre d'outils permet d'effectuer les actions suivantes :

source: |icon_run| Run the forecast for the chosen date and time.
fr: |icon_run| Lancer la prévision pour la date et l'heure choisies.

source: |icon_stop| Stop the current calculations.
fr: |icon_stop| Arrêter les calculs en cours.

source: |icon_preferences| Define the preferences.
fr: |icon_preferences| Définir les préférences.

source: To perform a forecast, one must:
fr: Pour effectuer une prévision, il faut :

source: Choose the date from the calendar and the time below. When the software is started, the date and time are set to the current values. The |icon_update| icon allows updating to the current values.
fr: Choisir la date dans le calendrier et l'heure en dessous. Au démarrage du logiciel, la date et l'heure sont réglées sur les valeurs actuelles. L'icône |icon_update| permet de mettre à jour les valeurs actuelles.

source: Start the forecast calculation by clicking on the |icon_run_s| icon in the toolbar.
fr: Lancez le calcul de la prévision en cliquant sur l'icône |icon_run_s| dans la barre d'outils.

source: The processed analog methods are those listed in the lower half of the interface. The methods can differ in terms of structure or parameters, for example, to be adapted for a subregion. The methods are executed one after the other. A |icon_bullet_yellow| icon means that the model is being processed, |icon_bullet_green| that the calculations have been successfully performed and |icon_bullet_red| that the forecast has failed for this method.
fr: Les méthodes d'analogues traitées sont celles listées dans la moitié inférieure de l'interface. Les méthodes peuvent différer en termes de structure ou de paramètres, par exemple pour être adaptées à une sous-région. Les méthodes sont exécutées l'une après l'autre. Une icône |icon_bullet_yellow| signifie que le modèle est en cours de calculs, |icon_bullet_green| que les calculs ont été effectués avec succès et |icon_bullet_red| que la prévision a échoué pour cette méthode.

source: Define the list of methods
fr: Définir la liste des méthodes
