Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/app-forecaster.po
Languages: fr

source: The list of analog methods can be completed, or methods can be deleted. A method here is a specific parameterization of an analog method optimal for a lead time or a region. It is represented in the graphical user interface by choice of a parameters file. An entry can be removed with the |icon_close| icon, and new ones can be added using the |icon_plus| icon below the list.
fr: La liste des méthodes d'analogues peut être complétée, ou des méthodes peuvent être supprimées. Une méthode est ici un paramétrage spécifique d'une méthode d'analogue optimale pour une échéance ou une région. Elle est représentée dans l'interface graphique par le choix d'un fichier de paramètres. Une entrée peut être supprimée à l'aide de l'icône |icon_close|, et de nouvelles entrées peuvent être ajoutées à l'aide de l'icône |icon_plus| située sous la liste.

source: The entries can be edited by clicking on the |icon_edit| icon. A dialog box appears to set the parameters file name (only the name, not the full path). The parameters file must be located in the directory defined in the preferences. It is an XML file that can be edited with a text editor. The structure of the file is described in the :ref:`parameters file section <parameters-file-forecaster>`. If the file is not found, the |icon_warning| icon is shown. The |icon_info| icon allows displaying the description of the parameters file in a tooltip. The |icon_details| icon allows displaying the content of the parameters file in a new frame (the content cannot be edited).
fr: Les entrées peuvent être modifiées en cliquant sur l'icône |icon_edit|. Une boîte de dialogue apparaît pour définir le nom du fichier de paramètres (uniquement le nom, pas le chemin d'accès complet). Le fichier de paramètres doit être situé dans le répertoire défini dans les préférences. Il s'agit d'un fichier XML qui peut être édité avec un éditeur de texte. La structure du fichier est décrite dans la section :ref:`fichier de paramètres <parameters-file-forecaster>`. Si le fichier n'est pas trouvé, l'icône |icon_warning| est affichée. L'icône |icon_info| permet d'afficher la description du fichier de paramètres dans une info-bulle. L'icône |icon_details| permet d'afficher le contenu du fichier de paramètres dans une nouvelle fenêtre (le contenu ne peut pas être édité).

source: When the list of methods has been modified and should be kept as default, it is necessary to save it (menu 'File / Save batch file'); otherwise, the list will be reset at the software restart.
fr: Lorsque la liste des méthodes a été modifiée et qu'elle doit être utilisée par défaut, il est nécessaire de la sauvegarder (menu 'Fichier / Enregistrer le fichier batch') ; sinon, la liste sera réinitialisée au redémarrage du logiciel.

source: Command line interface
fr: Interface en ligne de commande

source: The Forecaster also has a command-line interface, which makes it possible to automate forecasts on a server. A scheduled task can then be added on a server (ex: Task Scheduler on Windows or Cron task on Linux). The options are as follows:
fr: Le Forecaster dispose également d'une interface en ligne de commande, qui permet d'automatiser les prévisions sur un serveur. Une tâche planifiée peut alors être ajoutée sur un serveur (ex : Task Scheduler sous Windows ou tâche Cron sous Linux). Les options sont les suivantes :

source: Displays the help of command-line options
fr: Afficher l'aide des options en ligne de commande

source: Configure the forecaster
fr: Configurer le Forecaster

source: Displays the software version
fr: Afficher la version du logiciel

source: Batch file to use for the forecast (full path)
fr: Fichier batch à utiliser pour la prévision (chemin complet)

source: Run forecast for the latest available data
fr: Exécuter la prévision pour les dernières données disponibles

source: Run forecast for the given number of past days
fr: Exécuter les prévisions pour le nombre donné de jours passés

source: Run forecast for a specified date
fr: Exécuter les prévisions pour une date donnée

source: Set the log level (0: minimum, 1: errors, 2: warnings (default), 3: verbose)
fr: Définir le niveau du journal (0 : minimum, 1 : erreurs, 2 : avertissements (par défaut), 3 : verbeux)

source: Use proxy on given port
fr: Utiliser le proxy sur le port donné

source: Proxy user and password
fr: Utilisateur et mot de passe du proxy

source: Docker image
fr: Image Docker

source: A Docker image is available on DockerHub: https://hub.docker.com/r/atmoswing/forecaster
fr: Une image Docker est disponible sur DockerHub : https://hub.docker.com/r/atmoswing/forecaster

source: Get it with: ``docker pull atmoswing/forecaster``
fr: Obtenez-le avec : ``docker pull atmoswing/forecaster``

source: The docker container for AtmoSwing Forecaster uses the same options than the `command line interface` (to the exception of the ``--config`` option). However, different directories need to be mounted in the docker container to allow AtmoSwing accessing the data and saving outputs.
fr: Le conteneur docker pour AtmoSwing Forecaster utilise les mêmes options que l'interface en ligne de commande (à l'exception de l'option ``--config``). Cependant, différents répertoires doivent être montés dans le conteneur docker pour permettre à AtmoSwing d'accéder aux données et de sauvegarder les résultats.

source: The recommended way to use the docker container is to create a docker-compose file. An example is provided below:
fr: La manière recommandée d'utiliser le conteneur docker est de créer un fichier docker-compose. Un exemple est fourni ci-dessous :

source: Then, the batch file needs to contain the mounted directories in the docker container. If you changed the target directories above, you need to adapt them below as well. The batch file should look like:
fr: Ensuite, le fichier batch doit contenir les répertoires montés dans le conteneur docker. Si vous avez modifié les répertoires cibles ci-dessus, vous devez également les adapter ci-dessous. Le fichier batch doit ressembler à ça :
