Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/app-optimizer.po
Languages: fr

source: The validation period must be covered by the calibration period (to correctly load the required data). AtmoSwing then handles the validation period by excluding it from the calibration period. Once again: the validation period must not provide dates that are not covered by the calibration period.
fr: La période de validation doit être couverte par la période de calibration (pour charger correctement les données requises). AtmoSwing traite alors la période de validation en l'excluant de la période de calibration. Encore une fois : la période de validation ne doit pas contenir de dates qui ne sont pas couvertes par la période de calibration.

source: Two options are possible:
fr: Deux options sont possibles :

source: Providing a list of years (distributed over the calibration period):
fr: Fournir une liste d'années (réparties sur la période de calibration) :

source: ``<years>``: List of years (ex: 1985, 1990, 1995, 2000, 2005, 2010)
fr: ``<years>`` : Liste d'années (ex : 1985, 1990, 1995, 2000, 2005, 2010)

source: Alternatively, providing a range of years:
fr: Il est également possible de fournir une fourchette d'années :

source: ``<start_year>``: Start of the validation period (ex: 2001)
fr: ``<start_year>`` : Début de la période de validation (ex : 2001)

source: ``<end_year>``: End of the validation period (ex: 2010)
fr: ``<end_year>`` : Fin de la période de validation (ex : 2010)

source: Content 'evaluation'
fr: Contenu 'évaluation'

source: The Optimizer has a ``<evaluation>`` node to specify the score to use and other characteristics:
fr: L'Optimiseur possède un nœud ``<evaluation>`` pour spécifier le score à utiliser et d'autres caractéristiques :

source: Element 'score'
fr: Élément 'score'

source: The name of the score to use must be provided. Options are listed here: :ref:`verification scores<verification-scores>`
fr: Le nom du score à utiliser doit être fourni. Les options sont listées ici : :ref:`score de vérification<verification-scores>`

source: Element 'time_array'
fr: Élément 'time_array'

source: The ``<time_array>`` element must be provided. It should however be set to ``simple`` as there are no other options available yet.
fr: L'élément ``<time_array>`` doit être fourni. Il doit cependant avoir la valeur ``simple`` car il n'y a pas d'autres options disponibles pour l'instant.

source: Other optional properties
fr: Autres propriétés facultatives

source: Other options can be added to specify how the score should be processed.
fr: D'autres options peuvent être ajoutées pour spécifier comment le score doit être traité.

source: ``<threshold>``: Threshold to use for the processing of scores relying on thresholds exceedance, such as the contingency table. Example: ``<threshold>0.5</threshold>``
fr: ``<threshold>`` : Seuil à utiliser pour le calcul des scores reposant sur un dépassement de seuils, comme le tableau de contingence. Exemple : ``<threshold>0.5</threshold>``

source: ``<quantile>``: Quantile to use for the processing of scores relying on a single value rather than the distribution. Example: ``<quantile>0.9</quantile>``
fr: ``<quantile>`` : Quantile à utiliser pour le calcul des scores reposant sur une seule valeur plutôt que sur la distribution. Exemple : ``<quantile>0.9</quantile>``

source: ``<on_mean>1</on_mean>``: Specifies to process the score on the mean of the analogs rather that a quantile (see above). For example, when used with the score ``MSE``. The value 1 has no meaning other than "true".
fr: ``<on_mean>1</on_mean>`` : Spécifie que le score doit être calculé sur la moyenne des analogues plutôt que sur un quantile (voir ci-dessus). Par exemple, lorsqu'il est utilisé avec le score ``MSE``. La valeur 1 n'a pas d'autre signification que "vrai".

source: Classic calibration parameters file
fr: Fichier de paramètres de la calibration classique

source: The calibration parameters file defines the parameters to be calibrated and the range of the authorized values. There are different methods possible to define these options:
fr: Le fichier des paramètres de la calibration définit les paramètres à étalonner et la plage des valeurs autorisées. Il y a différentes méthodes possibles pour définir ces options :

source: ``minmax`` (the most used): you must provide a ``min`` value of the parameter, a ``max`` value and a ``step`` value. For example:
fr: ``minmax`` (le plus utilisé) : vous devez fournir une valeur ``min`` du paramètre, une valeur ``max`` et une valeur ``step``. Par exemple :

source: ``array``: the content of the node will then be parsed as an array. For example:
fr: ``array`` : le contenu du nœud sera alors traité comme un vecteur. Par exemple :

source: ``fixed``: should not be calibrated even if ``min`` and ``max`` values are defined. A value for the parameter must then be provided.
fr: ``fixed`` : ne doit pas être calibré même si des valeurs ``min`` et ``max`` sont définies. Une valeur doit alors être fournie pour le paramètre.

source: Root node
fr: Nœud racine

source: The ``target`` property of the root node needs to be ``calibrator``.
fr: La propriété ``target`` du nœud racine doit être ``calibrator``.

source: Content 'analog_dates'
fr: Contenu 'analog_dates'

source: The content of ``<analog_dates>`` is mostly similar to the :ref:`standard parameters file structure<parameters-file>`, but the parameters to calibrate need to be specified.
fr: Le contenu de ``<analog_dates>`` est en grande partie similaire à la structure du :ref:`fichier de paramètres standard<parameters-file>`, mais les paramètres à calibrer doivent être spécifiés.

source: Element ‘analogs_number’
fr: Élément 'analogs_number'

source: This element varies the number of analog situations Ni to consider, for example:
fr: Cet élément fait varier le nombre de situations analogues Ni à extraire, par exemple :

source: Element ‘spatial_window’
fr: Élément 'fenêtre spatiale'

source: This element defines the extent of the spatial window for each predictor. ``<x_min>`` and ``<y_min>`` are the minimum longitude and latitude respectively, ``<x_points_nb>`` and ``<y_points_nb>`` are the number of points from the predictor grid to use on the longitude and latitude axes, respectively. ``<x_step>`` and ``<y_step>`` are the longitude/latitude resolutions to use. This window needs to be defined for each predictor.
fr: Cet élément définit l'étendue de la fenêtre spatiale pour chaque prédicteur. ``<x_min>`` et ``<y_min>`` sont respectivement la longitude et la latitude minimales, ``<x_points_nb>`` et ``<y_points_nb>`` sont le nombre de points de la grille du prédicteur à utiliser sur les axes de longitude et de latitude, respectivement. ``<x_step>`` et ``<y_step>`` sont les résolutions longitude/latitude à utiliser. Cette fenêtre doit être définie pour chaque prédicteur.

source: Full example
fr: Exemple complet

source: Optimization parameters file
fr: Fichier des paramètres pour l'optimisation

source: The optimization parameters file used for genetic algorithms or Monte Carlo simulations defines the parameters to be optimized and the range of the authorized values. There are different aspects to this:
fr: Le fichier des paramètres pour l'optimisation, utilisé par les algorithmes génétiques ou les simulations de Monte Carlo, définit les paramètres à optimiser et la fourchette des valeurs autorisées. Il comporte plusieurs aspects :

source: Defining the range of numerical values: a ``lowerlimit`` value of the parameter, an ``upperlimit`` value, and an ``iteration`` value must be provided. For example:
fr: Définir la plage de valeurs numériques : une valeur ``lowerlimit`` (limite inférieure) du paramètre, une valeur ``upperlimit`` (limite supérieure) et une valeur ``iteration`` doivent être fournies. Par exemple :

source: Defining a list of values: the content of the node will then be parsed as an array. For example:
fr: Définir une liste de valeurs : le contenu du nœud sera alors analysé comme un vecteur. Par exemple :

source: The ``lock`` property allows to fix a value that will not be optimized even if ``lowerlimit`` and ``upperlimit`` values are defined, for example. You then need to provide a value for the parameter. It can be used to temporarily disable the calibration of a parameter. For example:
fr: La propriété ``lock`` permet de fixer une valeur qui ne sera pas optimisée même si les valeurs ``lowerlimit`` et ``upperlimit`` sont définies. Vous devez alors fournir une valeur pour le paramètre. Cette option peut être utilisée pour désactiver temporairement la calibration d'un paramètre. Par exemple :

source: The ``target`` property of the root node needs to be ``optimizer``.
fr: La propriété ``target`` du nœud racine doit être ``optimizer``.

source: Element ‘predictor’
fr: Élément 'predictor'

source: Example:
fr: Exemple :

source: Preferences
fr: Préférences

source: The preferences frame can be opened from the menu Options / Preferences of the main interface or with a button from the toolbar.
fr: La fenêtre des préférences peut être ouvert à partir du menu Options / Préférences de l'interface principale ou à l'aide d'un bouton de la barre d'outils.

source: Language
fr: Langue

source: The language can be changed from the drop-down list. The change is effective after restarting the software.
fr: La langue peut être modifiée à partir de la liste déroulante. Le changement est effectif après le redémarrage du logiciel.

source: Log options
fr: Options du journal (log)

source: Log preferences control the display of the log window and the level (importance) of reported messages:
fr: Les préférences de journal (log) contrôlent l'affichage de la fenêtre du journal et le niveau (importance) des messages rapportés :

source: Errors only - recommended as long as everything goes as planned.
fr: Erreurs uniquement - recommandé tant que tout se passe comme prévu.

source: Errors and warnings - some warnings help to be vigilant in case of problems. However, there might be warnings even during regular operation.
fr: Erreurs et avertissements - certains avertissements permettent d'être vigilant en cas de problème. Cependant, il peut y avoir des avertissements même pendant un fonctionnement normal.

source: Verbose - all operations are reported, which is an unnecessary amount of information during regular operation. As a result, important messages might be hidden in a large number of messages. This option is only useful to identify where AtmoSwing is failing.
fr: Verbose - toutes les opérations sont signalées, ce qui représente une quantité inutile d'informations lors d'une opération régulière. Par conséquent, des messages importants peuvent être cachés dans un grand nombre de messages. Cette option n'est utile que pour identifier les endroits où AtmoSwing rencontre des problèmes.

source: Directories
fr: Répertoires

source: Different directories must be specified:
fr: Différents répertoires doivent être spécifiés :

source: Directory containing the archive predictors (for example :ref:`reanalyses<reanalyses>`).
fr: Répertoire contenant les archives des prédicteurs (par exemple :ref:`reanalyses<reanalyses>`).

source: Directory containing the predictand DB (:ref:`NetCDF file generated from the predictand data<predictand-db>`).
fr: Répertoire contenant la base de données des prédictants (:ref:`fichier NetCDF généré à partir des données des prédictants<predictand-db>`).

source: Advanced options
fr: Options avancées

source: Graphical User Interface (GUI) options
fr: Options de l'interface utilisateur graphique (GUI)

source: Options to control the behavior of the interface and its means of communication with the user. Saves calculation time by disabling dialog boxes. The choices are:
fr: Options permettant de contrôler le comportement de l'interface et ses moyens de communication avec l'utilisateur. Permet de gagner du temps de calcul en désactivant les boîtes de dialogue. Les choix sont les suivants :

source: Silent - no dialog box is displayed. The user must, therefore, keep an eye on the log window to detect any error. This option is only useful for very intensive calculations.
fr: Silencieux - aucune boîte de dialogue n'est affichée. L'utilisateur doit donc garder un œil sur la fenêtre de journal pour détecter toute erreur. Cette option n'est utile que pour les calculs très intensifs.

source: Standard - recommended for regular use.
fr: Standard - recommandé pour une utilisation régulière.

source: Verbose - a bit more verbose than the Standard option.
fr: Verbose - un peu plus verbeux que l'option Standard.

source: Options for using multiple threads:
fr: Options pour l'utilisation de plusieurs threads :

source: Allow multithreading - allows a gain in performance for the calculations (recommended).
fr: Autoriser le multithreading - permet un gain de performance pour les calculs (recommandé).

source: Maximum number of threads - to be chosen according to the computer's CPU. The software automatically proposes the optimal number of threads for the computer in use.
fr: Nombre maximal de threads - à choisir en fonction du CPU de l'ordinateur. Le logiciel propose automatiquement le nombre optimal de threads pour l'ordinateur utilisé.

source: Threads priority - allows defining the priority of the threads in competition with other ongoing processes.
fr: Priorité des threads - permet de définir la priorité des threads en compétition avec les autres processus en cours.

source: Processing options
fr: Options de calculs

source: These options influence how the search for analogs is performed, which has no impact on the results, only on the calculation time. The choices are as follows:
fr: Ces options influencent la manière dont la recherche d'analogues est effectuée, ce qui n'a aucun impact sur les résultats, mais uniquement sur le temps de calcul. Les choix sont les suivants :

source: Multithreaded - as long as the computer has at least two processors. It is the fastest version.
fr: Multithreaded - pour autant que l'ordinateur possède au moins deux processeurs. Il s'agit de la version la plus rapide.

source: Standard - this option is slower than the previous one as it uses a single thread.
fr: Standard - cette option est plus lente que la précédente car elle utilise un seul thread.

source: Working directory
fr: Répertoire de travail

source: A working directory can be specified to save optional intermediate files, for example between levels of analogy.
fr: Un répertoire supplémentaire peut être spécifié pour enregistrer des fichiers intermédiaires optionels, par exemple entre les niveaux d'analogie.

source: User-specific paths
fr: Chemins d'accès spécifiques à l'utilisateur

source: Some paths automatically defined according to the OS: working directory, log file, and preferences file.
fr: Certains chemins sont définis automatiquement en fonction du système d'exploitation : le répertoire de travail, le fichier journal et le fichier de préférences.

source: Usage
fr: Utilisation

source: The Optimizer implements different optimization techniques, such as a semi-automatic sequential approach, Monte-Carlo simulations, and a global optimization technique using genetic algorithms. Establishing a statistical relationship between predictors and predictands is computationally intensive because it requires numerous assessments over decades.
fr: L'Optimizer fournit différentes techniques d'optimisation, telles qu'une approche séquentielle semi-automatique, des simulations de Monte-Carlo et une technique d'optimisation globale utilisant des algorithmes génétiques. L'établissement d'une relation statistique entre les prédicteurs et les prédictants est gourmand en ressources informatiques car il nécessite de nombreuses évaluations sur plusieurs décennies.

source: The calibration of the AM is usually performed in a perfect prognosis framework. Perfect prognosis uses observed or reanalyzed data to calibrate the relationship between predictors and predictands. As a result, perfect prognosis yields relationships that are as close as possible to the natural links between predictors and predictands. However, there are no perfect models, and even reanalysis data may contain biases that cannot be ignored. Thus, the considered predictors should be as robust as possible, i.e., they should have minimal dependency on the model.
fr: La calibration des MAs est généralement effectuée dans un cadre de pronostic parfait (perfect prognosis framework). Le pronostic parfait utilise des données observées ou réanalysées pour calibrer la relation entre les prédicteurs et les prédictants. En conséquence, le pronostic parfait produit des relations qui sont aussi proches que possible des liens naturels entre les prédicteurs et les prédictants. Cependant, il n'existe pas de modèles parfaits, et même les données de réanalyse peuvent contenir des biais qui ne peuvent être ignorés. Ainsi, les prédicteurs considérés doivent être aussi robustes que possible, c'est-à-dire qu'ils doivent avoir une dépendance minimale vis-à-vis du modèle.

source: A statistical relationship is established with a trial and error approach by processing a forecast for every day of a calibration period. A certain number of days close to the target date are excluded to consider only independent candidate days. Validating the parameters of AMs on an independent validation period is very important to avoid over-parametrization and to ensure that the statistical relationship is valid for another period. In order to account for climate change and the evolution of measuring techniques, it is recommended that a noncontinuous period for validation should be used, distributed over the entire archive (for example, every 5th year). AtmoSwing users can thus specify a list of the years to set apart for the validation that are removed from possible candidate situations. At the end of the optimization, the validation score is processed automatically. The different verification scores available are detailed :ref:`here<verification-scores>`.
fr: Une relation statistique est établie par essais et erreurs en calculant une prévision pour chaque jour d'une période de calibration. Un certain nombre de jours proches de la date cible sont exclus afin de ne prendre en compte que les jours candidats indépendants. Il est très important de valider les paramètres des MA sur une période de validation indépendante afin d'éviter une sur-paramétrisation et de s'assurer que la relation statistique est valable pour une autre période. Afin de tenir compte des changements climatiques et de l'évolution des techniques de mesure, il est recommandé d'utiliser une période de validation non continue, répartie sur l'ensemble des archives (par exemple, 1 année sur 5). Les utilisateurs d'AtmoSwing peuvent ainsi spécifier une liste d'années à mettre à part pour la validation qui sont retirées des situations candidates possibles. À la fin de l'optimisation, le score de validation est traité automatiquement. Les différents scores de vérification disponibles sont détaillés :ref:`ici<verification-scores>`.

source: Requirements
fr: Exigences

source: The Optimizer needs:
fr: L'Optimizer a besoin :

source: :ref:`A predictand database <predictand-db>`
fr: :ref:`D'une base de données de prédictants <predictand-db>`

source: :ref:`A predictors archive (e.g. a reanalysis dataset) <reanalyses>`
fr: :ref:`D'une archive de prédicteurs (par exemple un jeu de données de réanalyse) <reanalyses>`

source: :ref:`Parameters files defining the properties of the method. <parameters-file-optimizer>`
fr: :ref:`D'un fichier de paramètres définissant les propriétés de la méthode. <parameters-file-optimizer>`

source: Calibration methods
fr: Méthodes de calibration

source: The Optimizer provides different approaches listed below.
fr: L'Optimizer propose différentes approches, énumérées ci-dessous.

source: Evaluation-only approaches
fr: Approches d'évaluation uniquement

source: These methods do not seek to improve the parameters of the AM. They allow some assessments using the provided parameters. The different verification scores available are detailed :ref:`here<verification-scores>`.
fr: Ces méthodes ne cherchent pas à améliorer les paramètres des MAs. Elles permettent certaines évaluations à l'aide des paramètres fournis. Les différents scores de vérification disponibles sont détaillés :ref:`ici<verification-scores>`.

source: **Single assessment**: This approach processes the AM as described in the provided parameters file and assesses the defined score.
fr: **Évaluation unique** : Cette approche traite la MA comme décrit dans le fichier de paramètres fourni et évalue le score défini.

source: **Evaluation of all scores**: Similar as above, but assesses all the implemented scores.
fr: **Évaluation de tous les scores** : Identique au précédent, mais évalue tous les scores disponibles.

source: **Only predictand values**: Does not process a skill score, but processes the AM and save the analog values into a file.
fr: **Uniquement les valeurs prédictives** : Ne calcule pas de score de vérification, mais calcule la MA et enregistre les valeurs analogues dans un fichier.

source: **Only analog dates (and criteria)**: Does not process a skill score, neither assign predictand values to the analog dates. It only saves the analog dates identified by the defined AM into a file.
fr: **Uniquement les dates analogues (et les critères)** : Ne calcule pas de score de vérification et n'attribue pas de valeurs du prédictant aux dates analogues. Enregistre un fichier avec uniquement les dates analogues identifiées par la MA définie.

source: Based on the classic calibration
fr: Basé sur la calibration classique

source: The classic calibration is detailed :ref:`here<classic-calibration>`.
fr: La calibration classique est détaillé :ref:`ici<classic-calibration>`.

source: **Classic calibration**: The :ref:`classic calibration <classic-calibration>`
fr: **Calibration classique** : La :ref:`calibration classique <classic-calibration>`

source: **Classic+ calibration**: A :ref:`variant of the classic calibration<classic-calibration>` with some improvements.
fr: **Calibration classique+** : Une :ref:`variante de la calibration classique<classic-calibration>` avec quelques améliorations.

source: **Variables exploration Classic+**: Using the classic+ calibration to systematically explore a list of variables / levels / hours.
fr: **Exploration de variables Classique+** : Utilisation de la calibration classique+ pour explorer systématiquement une liste de variables / niveaux / heures.

source: Global optimization
fr: Optimisation globale

source: **Genetic algorithms**: The optimization using :ref:`genetic algorithms <genetic-algorithms>`.
fr: **Algorithmes génétiques** : L'optimisation utilisant des :ref:`algorithmes génétiques <genetic-algorithms>`.

source: Random exploration of the parameters space
fr: Exploration aléatoire de l'espace des paramètres

source: **Monte-Carlo simulations**: An exploration of the parameters space using Monte-Carlo simulations. These simulations were found to be limited in terms of ability to find reasonable parameters sets for even moderately complex AMs (1-2 levels of analogy with a few predictors).
fr: **Simulations de Monte-Carlo** : Exploration de l'espace des paramètres à l'aide de simulations de Monte-Carlo. Ces simulations se sont révélées limitées en termes de capacité à trouver des jeux de paramètres raisonnables pour des MA même modérément complexes (1 à 2 niveaux d'analogie avec quelques prédicteurs).

source: Outputs
fr: Sorties

source: The Optimizer produces different files:
fr: L'Optimizer produit différents fichiers :
