Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/app-viewer.po
Languages: fr

source: The Viewer
fr: Le Viewer

source: This section contains the documentation for AtmoSwing Viewer. This document can also be downloaded as a pdf or epub using the bottom left menu.
fr: Cette section contient la documentation pour AtmoSwing Viewer. Ce document peut également être téléchargé au format pdf ou epub en utilisant le menu en bas à gauche.

source: The Viewer manual is divided into the following topics:
fr: Le manuel du Viewer est divisé en plusieurs rubriques :

source: Preferences
fr: Préférences

source: The preferences frame can be opened from the menu Options / Preferences of the main interface or with a button from the toolbar.
fr: La fenêtre des préférences peut être ouvert à partir du menu Options / Préférences de l'interface principale ou à l'aide d'un bouton de la barre d'outils.

source: Workspace
fr: Espace de travail (workspace)

source: The propertied defined under this tab are specific for the workspace currently opened.
fr: Les propriétés définies sous cet onglet sont spécifiques à l'espace de travail (workspace) actuellement ouvert.

source: The directory where the forecasts are stored must be provided:
fr: Le répertoire dans lequel les prévisions sont enregistrées doit être indiqué :

source: The maximum predictand value for the color range defines the value for which red is assigned when colors are not standardized. The second option is the number of days of previous forecasts to be displayed as traces in the time series plots. Three to five days are recommended.
fr: La valeur maximale du prédictand pour la gamme de couleurs définit la valeur pour laquelle le rouge est attribué lorsque les couleurs ne sont pas normalisées. La deuxième option est le nombre de jours de prévisions antérieures à afficher sous forme de traces dans les graphiques de séries temporelles. Trois à cinq jours sont recommandés.

source: Alarm panel options: The alarm panel displays the highest value of all stations by lead time and method. The options are the return period for normalization and the quantile to be displayed. The quantile 0.9 allows remaining vigilant as to the possible occurrence of important events.
fr: Options du panneau d'alarme : Le panneau d'alarme affiche la valeur la plus élevée de toutes les stations par échéance et par méthode. Les options sont la période de retour pour la normalisation et le quantile à afficher. Le quantile 0.9 permet de rester vigilant quant à l'occurrence éventuelle d'événements importants.

source: General
fr: Général

source: Log options
fr: Options du journal (log)

source: Log preferences control the display of the log window and the level (importance) of reported messages:
fr: Les préférences de journal (log) contrôlent l'affichage de la fenêtre du journal et le niveau (importance) des messages rapportés :

source: Errors only - recommended as long as everything goes as planned.
fr: Erreurs uniquement - recommandé tant que tout se passe comme prévu.

source: Errors and warnings - some warnings help to be vigilant in case of problems. However, there might be warnings even during regular operation.
fr: Erreurs et avertissements - certains avertissements permettent d'être vigilant en cas de problème. Cependant, il peut y avoir des avertissements même pendant un fonctionnement normal.

source: Verbose - all operations are reported, which is an unnecessary amount of information during regular operation. As a result, important messages might be hidden in a large number of messages. This option is only useful to identify where AtmoSwing is failing.
fr: Verbose - toutes les opérations sont signalées, ce qui représente une quantité inutile d'informations lors d'une opération régulière. Par conséquent, des messages importants peuvent être cachés dans un grand nombre de messages. Cette option n'est utile que pour identifier les endroits où AtmoSwing rencontre des problèmes.

source: Internet proxy
fr: Proxy Internet

source: If required, proxy options can be provided. The proxy configuration contains the following elements:
fr: Si nécessaire, des options de proxy peuvent être fournies. La configuration du proxy contient les éléments suivants :

source: Proxy activation - if necessary.
fr: Activation du proxy - si nécessaire.

source: Proxy properties - the proxy address, port, the user name, and password.
fr: Propriétés du proxy - l'adresse du proxy, le port, le nom d'utilisateur et le mot de passe.

source: Advanced
fr: Avancé

source: Allow multiple instances of the Viewer, for example to display and compare different forecasts in separate windows.
fr: Permettre l'utilisation de plusieurs instances du Viewer, par exemple pour afficher et comparer différentes prévisions dans des fenêtres distinctes.

source: Some paths automatically defined according to the OS: working directory, log file, and preferences file.
fr: Certains chemins sont définis automatiquement en fonction du système d'exploitation : le répertoire de travail, le fichier journal et le fichier de préférences.

source: Usage
fr: Utilisation

source: The Viewer relies on `workspaces`_ (defined in xml files), where the path to the forecast files is specified as well as the GIS layers and other display options. It is thus possible to quickly change from one region to another.
fr: Le Viewer s'appuie sur des "espaces de travail" (`workspaces`_ ; définis dans des fichiers xml), où sont spécifiés le chemin d'accès aux fichiers de prévision, les couches SIG et d'autres options d'affichage. Il est ainsi possible de passer rapidement d'une région à l'autre.

source: For a given region, the forecasts can be separated/gathered based on an :ref:`identifier specified in the parameters files. <parameters-file>` (``<method_id>``). The Viewer will manage this information as follows:
fr: Pour une région donnée, les prévisions peuvent être séparées/rassemblées sur la base d'un :ref:`identifiant spécifié dans les fichiers de paramètres. <parameters-file>` (``<method_id>``). Le Viewer gère ces informations de la manière suivante :

source: ``<method_id>``: all forecast files with the same ``<method_id>`` will be aggregated in the Viewer and labeled according to ``<method_id_display>``.
fr: ``<method_id>`` : tous les fichiers de prévision ayant le même ``<method_id>`` seront agrégés dans le Viewer et étiquetés selon ``<method_id_display>``.

source: ``<specific_tag>``: all subregion-specific methods (defined by ``<specific_tag>`` and labelled according to ``<specific_tag_display>``) but having the same ``<method_id>`` will be listed under the same heading. These specific forecasts for a subregion/basin are defined by specific parameters, and therefore have analog dates that may differ from other subregions. When one of these subregions is selected in the Viewer, the forecast for that specific method is displayed and the precipitation values for the other subregions (but for the same method) are grayed-out. When the header of the list is selected (i.e., the method), a summary of the optimal forecasts for each subregion is displayed (i.e., with analog dates that may differ from one subregion to another).
fr: ``<specific_tag>`` : toutes les méthodes spécifiques à une sous-région (définies par ``<specific_tag>`` et étiquetées selon ``<specific_tag_display>``) mais ayant le même ``<method_id>`` seront répertoriées sous la même catégorie. Ces prévisions spécifiques pour une sous-région/bassin sont définies par des paramètres spécifiques et ont donc des dates analogues qui peuvent différer de celles des autres sous-régions. Lorsque l'une de ces sous-régions est sélectionnée dans le Viewer, la prévision pour cette méthode spécifique est affichée et les valeurs de précipitations pour les autres sous-régions (mais pour la même méthode) sont grisées. Lorsque l'en-tête de la liste est sélectionnée (c'est-à-dire la méthode), un résumé des prévisions optimales pour chaque sous-région est affiché (c'est-à-dire avec des dates analogues qui peuvent différer d'une sous-région à l'autre).

source: Main interface
fr: Interface principale

source: AtmoSwing Viewer has the interface shown below. It allows viewing the files produced by the Forecaster. The forecasts are first explored through the main interface on a map. Different graphs are then available to display more details.
fr: L'interface d'AtmoSwing Viewer est présentée ci-dessous. Il permet de visualiser les fichiers produits par le Forecaster. Les prévisions sont d'abord présentées dans l'interface principale sur une carte. Différents graphiques sont ensuite disponibles pour afficher plus de détails.

source: The toolbar allows the following actions:
fr: La barre d'outils permet d'effectuer les actions suivantes :

source: |icon-open| Open a forecast file
fr: |icon-open| Ouvrir un fichier de prévisions

source: |icon-run| Run the current forecast (calls the Forecaster)
fr: |icon-run| Démarrer la prévision en cours (appelle le Forecaster)

source: |icon-map-select| Select a station on the map
fr: |icon-map-select| Sélectionner une station sur la carte

source: |icon-map-zoom-in| Zoom in
fr: |icon-map-zoom-in| Zoom avant

source: |icon-map-zoom-out| Zoom out
fr: |icon-map-zoom-out| Zoom arrière

source: |icon-map-move| Pan the map
fr: |icon-map-move| Déplacer de la carte

source: |icon-map-fit| Adjust the map to all stations
fr: |icon-map-fit| Ajuster la carte à toutes les stations

source: |icon-frame-distributions| Open the distribution charts
fr: |icon-frame-distributions| Ouvrir les graphiques des distributions

source: |icon-frame-analogs| Open the list of analogues
fr: |icon-frame-analogs| Ouvrir la liste des analogues

source: |icon-preferences| Open the preferences
fr: |icon-preferences| Ouvrir les préférences

source: It is possible to open |icon-open_s| several forecast files, but they must have the same reference date (issued at the same lead time). If forecasts corresponding to another date (or time) are already opened, they will be closed.
fr: Il est possible d'ouvrir |icon-open_s| plusieurs fichiers de prévisions, mais ils doivent avoir la même date de référence (échéance de base). Si des prévisions correspondant à une autre date (ou heure) sont déjà ouvertes, elles seront fermées.

source: The first visualization is a summary of the next lead times (Figure below). At the location of each station, a circular band is displayed with one box per lead time. The colors assigned to each slice illustrate the expected value for the lead time in question. This representation provides a quick overview of the coming days and makes it easy to identify a possible event. The same map can also be displayed for a specific lead time (Figure above). The choice of the lead time is made using the cursor above the map.
fr: La première visualisation est un résumé des prochaines échéances (figure ci-dessous). Une bande circulaire avec une case par échéance est affichée à l'emplacement de chaque station. Les couleurs attribuées à chaque tranche illustrent la valeur attendue pour l'échéance en question. Cette représentation donne un aperçu rapide des jours à venir et permet d'identifier facilement un événement possible. La même carte peut également être affichée pour une échéance spécifique (figure ci-dessus). Le choix de l'échéance s'effectue à l'aide du curseur situé au-dessus de la carte.

source: Sidebar
fr: Barre latérale

source: The sidebar on the left-hand side of the map provides some information and controls.
fr: La barre latérale située à gauche de la carte fournit des informations et des contrôles.

source: **Forecasts**: Choice of method and its representation. All open methods are displayed in the upper box. The lower left box changes the color scale, and the lower right one offers the choice of the quantile to display (20%, 60%, or 90%).
fr: **Prévisions** : Choix de la méthode et de sa représentation. Toutes les méthodes ouvertes sont affichées dans la partie supérieure. La partie inférieure gauche modifie l'échelle de couleurs, et la partie inférieure droite permet de choisir le quantile à afficher (20%, 60% ou 90%).

source: **GIS layers**: Display options for the opened GIS layers (right-click). It is possible to change the following properties of the different layers, if available:
fr: **Couches SIG** : Options d'affichage pour les couches SIG ouvertes (clic droit). Il est possible de modifier les propriétés suivantes des différentes couches, si disponible :

source: Visibility - whether the layer is visible or not.
fr: Visibilité - si la couche est visible ou non.

source: Transparency - 0% is opaque and 100% is fully transparent.
fr: Transparence - 0% is opaque et 100% is entièrement transparent.

source: Color - it is applied to the layer features (lines & fill).
fr: Couleur - elle est appliquée aux éléments de la couche (lignes et remplissage).

source: The thickness of the line - for the lines or perimeters of polygons.
fr: L'épaisseur de la ligne - pour les lignes ou les périmètres des polygones.

source: **Alarms**: Shows the potentially critical situations. The different rows of the grid correspond to the different open methods and the columns to the available lead times. The displayed colors correspond to the highest value of all stations (worst case; precipitation value normalized by the rain of a selected return period).
fr: **Alarmes** : Affiche les situations potentiellement critiques. Les différentes lignes de la grille correspondent aux différentes méthodes ouvertes et les colonnes aux échéances disponibles. Les couleurs affichées correspondent à la valeur la plus élevée pour toutes les stations (cas le plus défavorable ; valeur des précipitations normalisée par la pluie d'une période de retour sélectionnée).

source: **Station selection**: Select the station to display the time series. An alternative to selection on the map.
fr: **Sélection de la station** : Sélectionner une station pour afficher sa série temporelle. Une alternative à la sélection sur la carte.

source: **Forecast caption**: Display of the dates corresponding to the different boxes of the circular bands, as well as the color bar.
fr: **Légende des prévisions** : Affichage des dates correspondant aux différentes cases des bandes circulaires, ainsi que de la barre de couleur.

source: Display of the time series
fr: Affichage des série temporelles

source: When a station is selected (on the map or in the drop-down list on the sidebar), the graph of the expected time series is displayed (Figure below). This graph corresponds to the selected method when clicking on the station. The display options (in the upper left panel) are as follows:
fr: Lorsqu'une station est sélectionnée (sur la carte ou dans la liste déroulante de la barre latérale), le graphique de la série temporelle attendue s'affiche (figure ci-dessous). Ce graphique correspond à la méthode sélectionnée lorsque l'on clique sur la station. Les options d'affichage (dans le panneau supérieur gauche) sont les suivantes :

source: The three classical quantiles (20%, 60%, 90%) in the form of thick blue lines.
fr: Les trois quantiles classiques (20%, 60%, 90%) sous forme de lignes bleues épaisses.

source: Every tenth of a quantile as a grey surface
fr: Chaque dixième de quantile comme surface grise

source: All analogs in the form of small grey crosses
fr: Toutes les valeurs analogues sous forme de petites croix grises

source: The ten best analogs as yellow - orange - red crosses. The colors are proportional to the rows of the analogs. Red is for the best analog and yellow for the 10th.
fr: Les dix meilleurs analogues sont représentés par des croix jaunes - orange - rouges. Les couleurs sont proportionnelles aux rangs des analogues. Le rouge correspond à la meilleure analogue et le jaune au dixième rang.

source: The five best analogs according to the same principle.
fr: Les cinq meilleurs analogues selon le même principe.

source: The value for a ten years return period in the form of a red line.
fr: La valeur pour une période de retour de dix ans sous la forme d'une ligne rouge.

source: The values of different return periods.
fr: Les valeurs des différentes périodes de retour.

source: Traces of the previous forecasts.
fr: Traces des prévisions précédentes.

source: The lower left panel is the list of the previous forecasts. These are automatically imported when displaying the graph.
fr: Le panneau inférieur gauche est la liste des prévisions précédentes. Celles-ci sont automatiquement importées lors de l'affichage du graphique.

source: Display of the distributions
fr: Affichage des distributions

source: Rainfall distributions are accessible via the |icon-frame-distributions_s| button on the toolbar. It allows plotting the distribution of all analogs comparatively to the best 5 or 10 (Figure below). The display options are similar to those of the time series (previous section). The method, station, and lead time must be selected in the upper part of the window.
fr: Les distributions de précipitations sont accessibles via le bouton |icon-frame-distributions_s| de la barre d'outils. La fenêtre permet de tracer la distribution de toutes les analogues par rapport aux 5 ou 10 meilleures (figure ci-dessous). Les options d'affichage sont similaires à celles des séries temporelles (section précédente). La méthode, la station et l'échéance doivent être sélectionnés dans la partie supérieure de la fenêtre.

source: The distribution of the analogy criterion is also available in the same window through the tab located above the graph (Figure below). This distribution makes it possible to identify possible discontinuities in the values of the criteria and thus to increase the confidence in the best analogs.
fr: La distribution du critère d'analogie est également disponible dans la même fenêtre par l'onglet situé au-dessus du graphique (Figure ci-dessous). Cette distribution permet d'identifier d'éventuelles discontinuités dans les valeurs des critères et ainsi d'accroître la confiance dans les meilleures analogues.

source: Display of the analog dates
fr: Affichage des dates analogues

source: The details of the analog dates and their associated criterion and predictand values (Figure below) are available through the |icon-frame-analogs_s| button on the toolbar. The method, station, and lead time must be selected in the upper part of the window. It is possible to sort the list by each of the columns by clicking on it. The first click ranks the values in ascending order and the second in descending order.
fr: Les détails des dates analogues et les valeurs de critère et de prédictand qui leur sont associées (figure ci-dessous) sont disponibles via le bouton |icon-frame-analogs_s| de la barre d'outils. La méthode, la station et l'échéance doivent être sélectionnés dans la partie supérieure de la fenêtre. Il est possible de trier la liste par chacune des colonnes en cliquant dessus. Le premier clic classe les valeurs par ordre croissant et le second par ordre décroissant.

source: Workspaces
fr: Espaces de travail (workspace)

source: AtmoSwing Viewer relies on workspaces to allow changing of region or configuration. A workspace is an xml file containing the paths to the GIS layers and their rendering options, as well as the forecast files location and other properties that can be defined in the preferences.
fr: AtmoSwing Viewer s'appuie sur des espaces de travail (workspaces) pour permettre de changer de région ou de configuration. Un espace de travail est un fichier xml contenant les chemins d'accès aux couches SIG et leurs options de rendu, ainsi que l'emplacement des fichiers de prévision et d'autres propriétés qui peuvent être définies dans les préférences.

source: The menu File allows to:
fr: Le menu Fichier permet de:

source: Open a workspace
fr: Ouvrir un espace de travail

source: Save the workspace
fr: Sauvegarder l'espace de travail

source: Save the workspace as
fr: Enregistrer l'espace de travail sous

source: Create a new workspace
fr: Créer un nouvel espace de travail

source: The creation of a new workspace is guided by a wizard to define:
fr: La création d'un nouvel espace de travail est guidée par un assistant qui permet de définir :

source: The location of the workspace file
fr: Emplacement du fichier de l'espace de travail

source: The path to the forecasts directory
fr: Chemin d'accès au répertoire des prévisions

source: The base map for the project.
fr: La carte de base du projet.

source: The base map options are:
fr: Les options de la carte de base sont les suivantes :

source: Custom layers
fr: Couches personnalisées

source: Terrain from Google maps
fr: Terrain à partir de Google maps

source: Map from Google maps
fr: Carte de Google maps

source: Map from OpenStreetMap
fr: Carte de OpenStreetMap

source: Map from ArcGIS Mapserver
fr: Carte à partir d'ArcGIS Mapserver

source: Satellite imagery from Google maps
fr: Images satellite de Google maps

source: Satellite imagery from VirtualEarth
fr: Images satellite de VirtualEarth

source: The workspace file does not need to be directly edited. The changes can be made through the interface and the workspace saved again. Its structure is as follows:
fr: Il n'est pas nécessaire de modifier directement le fichier de l'espace de travail. Les modifications peuvent être apportées par l'intermédiaire de l'interface et l'espace de travail peut être enregistré à nouveau. Sa structure est la suivante :
