Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/getting-started.po
Languages: fr

source: The common basic structure is illustrated below for the 2Z-2MI method (first level of analogy on the geopotential height and second on the moisture index) and explained later.
fr: La structure de base commune est illustrée ci-dessous pour la méthode 2Z-2MI (premier niveau d'analogie sur la hauteur géopotentielle et deuxième sur l'indice d'humidité) et expliquée plus loin.

source: Content 'description'
fr: Contenu 'description'

source: The content of ``<description>`` is mainly relevant for the Forecaster, where results are aggregated by methods for different regions.
fr: Le contenu de ``<description>`` est principalement pertinent pour le Forecaster, où les résultats sont agrégés par méthodes pour différentes régions.

source: ``<method_id>``: An ID given to the method (ex: 2Z)
fr: ``<method_id>`` : Un identifiant donné à la méthode (ex : 2Z)

source: ``<method_id_display>``: The name of the method (ex: Classic circulation)
fr: ``<method_id_display>`` : Le nom de la méthode (ex : Classic circulation)

source: ``<specific_tag>``: A tag to identify the specific settings. This is usually the name of the region for which the method was calibrated.
fr: ``<specific_tag>`` : Une étiquette permettant d'identifier les paramètres spécifiques. Il s'agit généralement du nom de la région pour laquelle la méthode a été calibrée.

source: ``<specific_tag_display>``: A more descriptive text for the provided ``<specific_tag>`` above.
fr: ``<specific_tag_display>`` : Un texte plus descriptif pour le ``<specific_tag>`` fourni ci-dessus.

source: ``<description>``: A possible additionnal description.
fr: ``<description>`` : Une description supplémentaire possible.

source: Example:
fr: Exemple :

source: Content 'time_properties'
fr: Contenu 'time_properties'

source: The content of ``<time_properties>`` defines the archive period and other temporal properties.
fr: Le contenu de ``<time_properties>`` définit la période de l'archivage et d'autres propriétés temporelles.

source: Element 'archive_period'
fr: Élément 'archive_period'

source: The content of ``<archive_period>`` defines the archive period where the analog situations will be extracted. Two options are possible:
fr: Le contenu de ``<archive_period>`` définit la période de l'archive pour laquelle les situations analogues seront extraites. Deux options sont possibles :

source: Providing the exact dates:
fr: En fournissant les dates exactes :

source: ``<start>``: Start of the archive period (ex: 01.01.1981)
fr: ``<start>`` : Début de la période de l'archive (ex : 01.01.1981)

source: ``<end>``: End of the archive period (ex: 31.12.2010)
fr: ``<end>`` : Fin de la période de l'archive (ex : 31.12.2010)

source: Alternatively, only providing the years:
fr: Il est également possible de ne fournir que les années :

source: ``<start_year>``: Start of the archive period (ex: 1962)
fr: ``<start_year>`` : Début de la période de l'archive (ex : 1962)

source: ``<end_year>``: End of the archive period (ex: 2008)
fr: ``<end_year>`` : Fin de la période de l'archive (ex : 2008)

source: Element 'time_step'
fr: Élément 'time_step'

source: The ``<time_step>`` is time step in hours of the predictand (ex: 24), and thus of the method.
fr: Le ``<time_step>`` est le pas de temps en heures du prédictand (ex : 24), et donc de la méthode.

source: Element 'time_array_target'
fr: Élément "time_array_target"

source: The content of ``<time_array_target>`` defines the temporal properties of the target.
fr: Le contenu de ``<time_array_target>`` définit les propriétés temporelles de la cible.

source: ``<time_array>``: Type of time selection.
fr: ``<time_array>`` : Type de sélection temporelle.

source: The type can be one of the following:
fr: Le type peut être l'un des suivants :

source: ``simple``: standard full temporal selection
fr: ``simple`` : sélection temporelle complète standard

source: ``DJF``: Winter (Dec-Feb)
fr: ``DJF`` : Hiver (déc.-fév.)

source: ``MAM``: Spring (Mar-May)
fr: ``MAM`` : Printemps (mars-mai)

source: ``JJA``: Summer (Jun-Aug)
fr: ``JJA`` : Été (juin-août)

source: ``SON``: Fall (Sep-Nov)
fr: ``SON`` : Automne (sept-nov)

source: ``predictand_thresholds``: Selection of days based on a predictand threshold (ex: days with more than x mm of precipitation)
fr: ``predictand_thresholds`` : Sélection des jours sur la base d'un seuil du prédictand (ex : jours avec plus de x mm de précipitations)

source: ``Month_to_Month``: Flexible selection of a period from one month to another month (ex: April_to_July, January_to_September, September_to_March)
fr: ``Month_to_Month`` : Sélection flexible d'une période d'un mois à l'autre (ex : April_to_July, January_to_September, September_to_March)

source: In case of a selection based on a predictand threshold (``predictand_thresholds``), the following elements must be specified:
fr: Dans le cas d'une sélection basée sur un seuil du prédictand (``predictand_thresholds``), les éléments suivants doivent être spécifiés :

source: ``<predictand_serie_name>``: selection of the raw (``data_raw``) or normalized data (``data_normalized``)
fr: ``<predictand_serie_name>`` : sélection des données brutes (``data_raw``) ou normalisées (``data_normalized``)

source: ``<predictand_min_threshold>``: Minimum threshold value
fr: ``<predictand_min_threshold>`` : Valeur minimale du seuil

source: ``<predictand_max_threshold>``: Maximum threshold value
fr: ``<predictand_max_threshold>`` : Valeur maximale du seuil

source: Element 'time_array_analogs'
fr: Élément 'time_array_analogs'

source: The content of ``<time_array_analogs>`` defines the temporal properties of the analog selection. It is usually defined as a days interval (four months centered around the target date) using +-60 days around the target date. When working in a perfect prognosis framework, 30 days around the target date are excluded for the same year as the target date.
fr: Le contenu de ``<time_array_analogs>`` définit les propriétés temporelles de la sélection des analogues. Il est généralement défini comme un intervalle de jours (quatre mois centrés autour de la date cible) base sur +-60 jours autour de la date cible. En calibration, 30 jours autour de la date cible sont exclus pour la même année que la date cible.

source: ``<interval_days>``: Number of days to select around the target date for every year when using ``days_interval``. Usually: 60
fr: ``<interval_days>`` : Nombre de jours à sélectionner autour de la date cible pour chaque année lors de l'utilisation de ``days_interval``. Habituellement : 60

source: ``<exclude_days>``: Number of days to exclude around the target date for the same year. It has to be provided whatever type of time array is selected. Usually: 30
fr: ``<exclude_days>`` : Nombre de jours à exclure autour de la date cible pour la même année (pour la phase de calibration). Il doit être fourni quel que soit le type de sélection temporelle. En général : 30

source: ``days_interval``: the standard selection of +-x days around the target date.
fr: ``days_interval`` : la sélection standard de +-x jours autour de la date cible.

source: ``simple``: full temporal selection
fr: ``simple`` : sélection temporelle complète

source: However, when selecting a season or a specific period for the analogs time array, the same option must be selected for the `Element 'time_array_target'`_.
fr: Cependant, lorsque l'on sélectionne une saison ou une période spécifique pour le type de selection temporelle des analogues, la même option doit être sélectionnée pour l'élément 'time_array_target'`_.

source: Another example using a specific period:
fr: Autre exemple d'utilisation d'une période spécifique :

source: Content 'analog_dates'
fr: Contenu 'analog_dates'

source: The content of ``<analog_dates>`` defines the analogy for a given analogy level. Several analogy levels can be successively defined by adding more ``<analog_dates>`` blocks one after the other. Every new level (block) will then subsample from the previous level.
fr: Le contenu de ``<analog_dates>`` définit l'analogie pour un niveau d'analogie donné. Plusieurs niveaux d'analogie peuvent être définis successivement en ajoutant des blocs ``<analog_dates>`` lles uns après les autres. Chaque nouveau niveau (bloc) sera alors sous-échantillonné à partir du niveau précédent.

source: Element 'analogs_number'
fr: Élément 'analogs_number'

source: The tag ``<analogs_number>`` defined the number of analogs to select for the given analogy level.
fr: La balise ``<analogs_number>`` définit le nombre d'analogues à sélectionner pour le niveau d'analogie donné.

source: Element 'predictor'
fr: Élément 'predictor'

source: The element ``<predictor>`` provides information about the predictor, the spatial window, and the criteria to use. Several predictors can be used together in an analogy level and are provided by adding more ``<predictor>`` blocks one after the other.
fr: L'élément ``<predictor>`` fournit des informations sur le prédicteur, la fenêtre spatiale et les critères à utiliser. Plusieurs prédicteurs peuvent être utilisés ensemble dans un niveau d'analogie et sont spécifiés en ajoutant des blocs ``<predictor>`` les uns après les autres.

source: The ``<predictor>`` element must define:
fr: L'élément ``<predictor>`` doit définir :

source: ``<preload>``: Defines if the data must be loaded in memory or not (0/1; optional)
fr: ``<preload>`` : Définit si les données doivent être chargées en mémoire ou non (0/1 ; optionnel)

source: ``<dataset_id>``: Defines the dataset to be used (:ref:`see the reanalyses list<reanalyses>`)
fr: ``<dataset_id>`` : Définit le jeu de données à utiliser (:ref:`voir la liste des réanalyses<reanalyses>`)

source: ``<data_id>``: Defines the variable to be used (:ref:`see the variables list<variables>`)
fr: ``<data_id>`` : Définit la variable à utiliser (:ref:`voir la liste des variables<variables>`)

source: ``<level>``: Selection of the predictor level (ex: 500 for 500 hPa or 0 for surface)
fr: ``<level>`` : Sélection du niveau du prédicteur (ex : 500 pour 500 hPa ou 0 pour la surface)

source: ``<time>``: Selection of the predictor time (ex: 12 for 12h UTC)
fr: ``<time>`` : Sélection de l'instant du prédicteur (ex : 12 pour 12h UTC)

source: ``<members>``: Number of members to select (optional; only for ensemble datasets)
fr: ``<members>`` : Nombre de membres à sélectionner (facultatif ; uniquement pour les ensembles de données)

source: ``<criteria>``: Criteria to use (ex: S1; :ref:`see the list of criteria<analogy-criteria>`)
fr: ``<criteria>`` : Critères à utiliser (ex : S1 ; :ref:`voir la liste des critères<analogy-criteria>`)

source: ``<weight>``: Weight to give to the predictor when averaging the different criteria values from the different predictors of a level of analogy (ex: 0.6). Optional: if not provided, equal weight is given to all predictors.
fr: ``<weight>`` : Poids à donner au prédicteur lors le la moyenne des différentes valeurs de critères des différents prédicteurs d'un niveau d'analogie (ex : 0.6). Facultatif : s'il n'est pas fourni, le même poids est donné à tous les prédicteurs.

source: ``<spatial_window>``: The spatial window on which the predictor variable is compared by means on the criterion. The window is defined by its minimum X (``<x_min>``) and Y (``<y_min>``) coordinates, the number of points in the direction of higher values (``<x_points_nb>`` and ``<y_points_nb>``) and the desired resolution (``<x_step>`` and ``<y_step>``).
fr: ``<spatial_window>`` : La fenêtre spatiale sur laquelle la variable prédictive est comparée au moyen du critère. La fenêtre est définie par ses coordonnées X (``<x_min>``) et Y (``<y_min>``) minimales, le nombre de points dans la direction des valeurs plus élevées (``<x_points_nb>`` et ``<y_points_nb>``) et la résolution souhaitée (``<x_step>`` et ``<y_step>``).

source: When using an elaborated predictor, the data must go through a preprocessing routine. In this case, the structure is a bit different and can look like this (several predictors can also be defined one after the other):
fr: Lors de l'utilisation d'un prédicteur élaboré, les données doivent passer par une routine de prétraitement. Dans ce cas, la structure est un peu différente et peut ressembler à ceci (plusieurs prédicteurs peuvent également être définis les uns après les autres) :

source: In this case, there is a new ``<preprocessing>`` block containing:
fr: Dans ce cas, il y a un nouveau bloc ``<preprocessing>`` contenant :

source: ``<preprocessing_method>``: The :ref:`preprocessing method<preprocessing>` to use.
fr: ``<preprocessing_method>`` : La :ref:`méthode de preprocessing<preprocessing>` à utiliser.

source: ``<preprocessing_data>``: The predictor data to preprocess defined by ``<dataset_id>``, ``<data_id>``, ``<level>``, and ``<time>``.
fr: ``<preprocessing_data>`` : Les données prédicteurs à prétraiter définies par ``<dataset_id>``, ``<data_id>``, ``<level>``, et ``<time>``.

source: The rest of the parameters ``<spatial_window>``, ``<criteria>``, and ``<weight>`` are common for the preprocessed predictors.
fr: Les autres paramètres ``<spatial_window>``, ``<criteria>`` et ``<weight>`` sont communs aux prédicteurs prétraités.

source: Content 'analog_values'
fr: Contenu 'analog_values'

source: Element 'predictand'
fr: Élément 'predictand'

source: Specification of the target predictand timeseries:
fr: Spécification de la série temporelle du prédictand cible :

source: ``<station_id>``: :ref:`Station ID<predictand-db>` or list of station IDs (separated by commas)
fr: ``<station_id>`` : :ref:`ID de la station/région<predictand-db>` ou liste d'ID de stations/régions (séparées par des virgules)

source: Predictand DB
fr: La base de données des prédictands

source: The preditand data (e.g., precipitation) must be prepared for use in AtmoSwing. A tool provided along AtmoSwing allows for the 'database' generation. Database generation consists of extracting data from text files and combining them into a NetCDF file.
fr: Les données relatives aux prédictands (par exemple, les précipitations) doivent être préparées pour être utilisées dans AtmoSwing. Un outil fourni avec AtmoSwing permet de générer la "base de données". La génération de la base de données consiste à extraire les données des fichiers texte et à les combiner dans un fichier NetCDF.

source: The interface for generating the precipitation database is accessible through the 'Tools / Build predictand DB' menu from any AtmoSwing module.
fr: L'interface de génération de la base de données des précipitations est accessible par le menu "Tools / Build predictand DB" à partir de n'importe quel module d'AtmoSwing.

source: The first step consists in choosing the type of database to generate. The options are as follows:
fr: La première étape consiste à choisir le type de base de données à générer. Les options sont les suivantes :

source: Predictand parameter:
fr: Paramètre du prédictand :

source: Precipitation
fr: Precipitation (Précipitations)

source: Temperature
fr: Temperature (Température)

source: Lightning
fr: Foudre

source: Other
fr: Other (Autre)

source: Temporal resolution:
fr: Résolution temporelle :

source: 24 hours
fr: 24 heures

source: 6 hours
fr: 6 heures

source: 1-hr MTW (moving time window, see [Horton2017]_)
fr: 1-hr MTW (moving time window, voir [Horton2017]_)

source: 3-hr MTW (moving time window, see [Horton2017]_)
fr: 3-hr MTW (moving time window, voir [Horton2017]_)

source: 6-hr MTW (moving time window, see [Horton2017]_)
fr: 6-hr MTW (moving time window, voir [Horton2017]_)

source: 12-hr MTW (moving time window, see [Horton2017]_)
fr: 12-hr MTW (moving time window, voir [Horton2017]_)

source: Spatial aggregation:
fr: Agrégation spatiale :

source: Groupment
fr: Groupment (Groupement)

source: Catchment
fr: Catchment (Bassin versant)

source: Region
fr: Région

source: The resulting file will contain the raw predictand data, but can also contain transformed data depending on the predictand variable (see section `Transformed data`_).
fr: Le fichier résultant contiendra les données brutes du prédictand, mais peut également contenir des données transformées en fonction de la variable du prédictand (voir la section `Données transformées`_).

source: Next, a couple of paths must be provided:
fr: Ensuite, il faut fournir quelques chemins d'accès :

source: The predictand catalog: `a catalog (xml file) <#predictand-catalog>`_ is required to provide some metadata on the different time series.
fr: Le catalogue des prédictands : `un catalogue (fichier xml) <#predictand-catalog>`_ est nécessaire pour fournir des métadonnées sur les différentes séries temporelles.

source: The predictand data directory: the directory containing the original predictand files.
fr: Le répertoire des données du prédictand : le répertoire contenant les fichiers originaux du prédictand.

source: The file patterns description directory: the directory containing `files defining the structure <#predictand-file-structure>`_ of the original predictand files.
fr: Le répertoire de description des modèles de fichiers : le répertoire contenant les `fichiers définissant la structure <#predictand-file-structure>`_ des fichiers contenant les series temporelles.

source: The destination directory: where the resulting file will be saved.
fr: Le répertoire de destination : où le fichier résultant sera enregistré.

source: After execution, a NetCDF file containing all the data necessary for the software is created in the chosen directory. This file also includes the station properties and time series.
fr: Après exécution, un fichier NetCDF contenant toutes les données nécessaires au logiciel est créé dans le répertoire choisi. Ce fichier comprend les propriétés des stations/régions et les séries temporelles.

source: Transformed data
fr: Données transformées

source: In addition to the raw predictand data, the resulting NetCDF file can also contain transformed data. The available options depend on the predictand variable. It is important to note that this normalized data will be used for the calibration of the method, but the raw data is used in the Forecaster and the Downscaler.
fr: Outre les données brutes du prédictand, le fichier NetCDF résultant peut également contenir des données transformées. Les options disponibles dépendent de la variable du prédictand. Il est important de noter que ces données normalisées seront utilisées pour l'étalonnage de la méthode, mais que les données brutes sont utilisées dans le Forecaster et le Downscaler.

source: During the data processing, Gumbel adjustments are automatically made to calculate the precipitation values corresponding to different return periods. The possible transformations are then:
fr: Lors du traitement des données, des ajustements de Gumbel sont automatiquement effectués pour calculer les valeurs de précipitations correspondant aux différentes périodes de retour. Les transformations possibles sont alors :

source: A normalization of the precipitation amount by a chosen return period value (often 10 years)
fr: Normalisation de la quantité de précipitations par une valeur correspondant à une période de retour choisie (souvent 10 ans)

source: A transformation by the square root of the normalized precipitation amounts (see [Bontron2004]_)
fr: Une transformation par la racine carrée des quantités de précipitations normalisées (voir [Bontron2004]_)

source: The lightning data can be transformed using: log10( N + 1 )
fr: Les données relatives aux éclairs peuvent être transformées en utilisant : log10( N + 1 )

source: Predictand catalog
fr: Catalogue des prédictands

source: The predictand catalog provides some metadata on the predictand time series. It is only required to create the predictand database and is not used afterwards. It consists of an xml file such as:
fr: Le catalogue du prédictand fournit des métadonnées sur les séries temporelles du prédictand. Il n'est nécessaire que pour créer la base de données du prédictand et n'est pas utilisé par la suite. Il se compose d'un fichier xml tel que :

source: The dataset is described by the following data:
fr: Le jeu de données est décrit par les données suivantes :

source: ``<id>``: a name given to the dataset (short)
fr: ``<id>`` : nom donné au jeu de données (court)

source: ``<name>``: the full name of the dataset
fr: ``<name>`` : le nom complet du jeu de données

source: ``<description>``: additional description (optional)
fr: ``<description>`` : description supplémentaire (facultative)

source: ``<parameter>``: the measured parameter (see above; ex: Precipitation)
fr: ``<parameter>`` : le paramètre mesuré (voir ci-dessus ; ex : Precipitation)

source: ``<unit>``: the unit of the measure (ex: mm)
fr: ``<unit>`` : l'unité de mesure (ex : mm)

source: ``<temporal_resolution>``: the temporal resolution (see above; ex: Daily)
fr: ``<temporal_resolution>`` : la résolution temporelle (voir ci-dessus ; ex : Daily)

source: ``<spatial_aggregation>``: the spatial aggregation (see above; ex: Station)
fr: ``<spatial_aggregation>`` : l'agrégation spatiale (voir ci-dessus ; ex : Station)

source: ``<time_zone>``: time zone of the measurement time (ex: 0 for UTC)
fr: ``<time_zone>`` : fuseau horaire de la mesure (ex : 0 pour UTC)

source: ``<start>``: first time step of all stations DD/MM/YYYY (ex: 01/01/1864)
fr: ``<start>`` : premier pas de temps de toutes les stations JJ/MM/AAAA (ex : 01/01/1864)

source: ``<end>``: last time step of all stations DD/MM/YYYY (ex: 31/12/2015)
fr: ``<end>`` : dernier pas de temps de toutes les stations JJ/MM/AAAA (ex : 31/12/2015)

source: ``<first_time_step>``: first time step (ex: 0)
fr: ``<first_time_step>`` : premier pas de temps (ex : 0)

source: ``<nan>``: representation of nan values
fr: ``<nan>`` : représentation des valeurs de nan

source: ``<coordinate_system>``: the EPSG code of the coordinate system (ex: EPSG:21781)
fr: ``<coordinate_system>`` : le code EPSG du système de coordonnées (ex : EPSG:21781)

source: Then, every time series (named here 'station', even if they are not representing a station) must be detailed under a ``<station>`` tag in the ``<stations>`` list. For every station, the following information can/must be provided:
fr: Ensuite, chaque série temporelle (appelée ici "station", même si elle ne représente pas une station) doit être détaillée sous une étiquette ``<station>`` dans la liste ``<stations>``. Pour chaque station, les informations suivantes peuvent/doivent être fournies :

source: ``<id>``: a unique ID (integer) to identify the station in AtmoSwing (unique number for the considered catalog)
fr: ``<id>`` : un identifiant unique (entier) pour identifier la station dans AtmoSwing (numéro unique pour le catalogue considéré)

source: ``<name>``: the name of the station
fr: ``<name>`` : le nom de la station

source: ``<official_id>``: an official ID (optional)
fr: ``<official_id>`` : un éventuel identifiant officiel (facultatif)

source: ``<x_coordinate>``: the X coordinate (in the coordinate system defined for the dataset)
fr: ``<x_coordinate>`` : la coordonnée X (dans le système de coordonnées défini pour le jeu de données)

source: ``<y_coordinate>``: the Y coordinate (in the coordinate system defined for the dataset)
fr: ``<y_coordinate>`` : la coordonnée Y (dans le système de coordonnées défini pour le jeu de données)

source: ``<height>``: the station height (optional)
fr: ``<height>`` : la hauteur de la station (facultatif)

source: ``<file_name>``: the file name containing the original data
fr: ``<file_name>`` : le nom du fichier contenant les données originales
