Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/getting-started.po
Languages: fr

source: ``<file_pattern>``: `the pattern describing the data file structure <#predictand-file-structure>`_
fr: ``<file_pattern>`` : `le modèle décrivant la structure du fichier de données <#predictand-file-structure>`_

source: ``<start>``: the start of the time series DD/MM/YYYY
fr: ``<start>`` : début de la série temporelle JJ/MM/AAAA

source: ``<end>``: the end of the time series DD/MM/YYYY
fr: ``<end>`` : fin de la série temporelle JJ/MM/AAAA

source: Predictand file structure
fr: Structure du fichier des prédictands

source: It was chosen not to force users to transform their data into a specific format but to let them describe the structure of the files. It must be done using files describing the structure of the original time series. The structure file defines how to read data files and is described in text files. However, a restriction is imposed: a data file must contain only one time series (single station), or structure files must be defined to read a specific column.
fr: Il a été choisi de ne pas forcer les utilisateurs à transformer leurs données dans un format spécifique, mais de les laisser décrire la structure des fichiers. Cela doit être fait en utilisant des fichiers décrivant la structure de la série temporelle originale. Le fichier de structure définit comment lire les fichiers de données et est décrit dans des fichiers texte. Une restriction est toutefois imposée : un fichier de données ne doit contenir qu'une seule série temporelle (une seule station), ou les fichiers de structure doivent être définis pour lire une colonne spécifique.

source: Files can be structured (``<structure_type>``) in two common types:
fr: Les fichiers peuvent être structurés (``<structure_type>``) selon deux types courants :

source: Delimited by tabs (``tabsdelimited``)
fr: Délimité par des tabulations (``tabsdelimited``)

source: With constant line width (``constantwidth``)
fr: Avec une largeur de ligne constante (``constantwidth``)

source: An option (``<parsetime>``) allows reading the date/time entries or ignore them. Reading this information allows an automatic check of the correct consistency of the dates between what the software thinks it is reading and what it is actually reading. It is therefore recommended to enable this option (``<parse_time>1</parse_time>``).
fr: Une option (``<parsetime>``) permet de lire les entrées de date et d'heure ou de les ignorer. La lecture de ces informations permet de vérifier automatiquement la cohérence des dates entre ce que le logiciel pense lire et ce qu'il lit réellement. Il est donc recommandé d'activer cette option (``<parse_time>1</parse_time>``).

source: Several files are installed with AtmoSwing and can be found in the 'data/file_patterns' directory, or `online in the repository <https://github.com/atmoswing/atmoswing/tree/master/data/file_patterns>`_.
fr: Plusieurs fichiers sont installés avec AtmoSwing et peuvent être trouvés dans le répertoire 'data/file_patterns', ou `en ligne dans le dépôt <https://github.com/atmoswing/atmoswing/tree/master/data/file_patterns>`_.

source: Example of the type 'delimited by tabs'
fr: Exemple de type 'délimité par des tabulations'

source: This type straightforwardly defines structured files, eventually with date entries (year, month, day) and data separated by tabs (see example below). The files contain exactly two header lines:
fr: Ce type définit directement des fichiers structurés, éventuellement avec des entrées de date (année, mois, jour) et des données séparées par des tabulations (voir l'exemple ci-dessous). Les fichiers contiennent exactement deux lignes d'en-tête :

source: The structure describing such data files is as follows:
fr: La structure décrivant ces fichiers de données est la suivante :

source: Example of the type 'constant line width'
fr: Exemple de type 'largeur de ligne constante'

source: Predictand files are here structured as constant line width.
fr: Les fichiers du prédictand sont ici structurés par des lignes de largeur constante.

source: Preprocessing routines
fr: Routines de prétraitement

source: Some elaborated variables need to be preprocessed, such as the moisture index. Thus, different preprocessing routines are available in AtmoSwing.
fr: Certaines variables élaborées doivent être prétraitées, comme l'indice d'humidité. Ainsi, différentes routines de prétraitement sont disponibles dans AtmoSwing.

source: The main preprocessing routines implemented are:
fr: Les principales routines de prétraitement implémentées sont les suivantes :

source: Addition (``Addition``): add (point-wise) all the provided predictors.
fr: Addition (``Addition``) : somme (point par point) tous les prédicteurs fournis.

source: Average (``Average``): average (point-wise) all the provided predictors.
fr: Moyenne (``Average``) : moyenne (point par point) tous les prédicteurs fournis.

source: Difference (``Difference``): process the difference (point-wise) between 2 predictor grids.
fr: Difference (``Différence``) : calcule la différence (point par point) entre 2 grilles de prédicteurs.

source: Multiplication (``Multiplication`` or ``Multiply``): multiply (point-wise) all the provided predictors.
fr: Multiplication (``Multiplication`` ou ``Multiply``) : multiplie (point par point) tous les prédicteurs fournis.

source: Humidity (or moisture) index (``HumidityIndex``): multiply the relative humidity and the precipitable water
fr: Indice d'humidité (``HumidityIndex``) : multiplie l'humidité relative et l'eau précipitable

source: Humidity (or moisture) flux (``HumidityFlux``): process the multiplication of the wind and the humidity index. Requires four predictors in the following order: 1) U wind, 2) V wind, 3) relative humidity and 4) precipitable water
fr: Flux d'humidité (``HumidityFlux``) : multiplie le vent et l'indice d'humidité. Nécessite quatre prédicteurs dans l'ordre suivant : 1) vent U, 2) vent V, 3) humidité relative et 4) eau précipitable

source: Wind speed (``WindSpeed``): process the wind speed with the provided U wind and V wind components.
fr: Vitesse du vent (``WindSpeed``) : calcule la vitesse du vent avec les composantes U et V fournies.

source: The following preprocessing routines are usually not used directly (or are automatically handled by AtmoSwing):
fr: Les routines de prétraitement suivantes ne sont généralement pas utilisées directement (ou sont automatiquement gérées par AtmoSwing) :

source: Simple gradients (``SimpleGradients``): processing of differences between adjacent grid points by ignoring the horizontal distance.
fr: Gradients simples (``SimpleGradients``) : traitement des différences entre des points de grille adjacents en ignorant la distance horizontale.

source: Real gradients (``RealGradients``): processing of real gradients between adjacent grid points (using the horizontal distance). This preprocessing method is automatically used when the analogy criterion is ``S1``.
fr: Real gradients (``RealGradients``) : traitement des gradients réels entre des points de grille adjacents (en utilisant la distance horizontale). Cette méthode de prétraitement est automatiquement utilisée lorsque le critère d'analogie est ``S1``.

source: Simple gradients with Gaussian weights (``SimpleGradientsWithGaussianWeights``): same as before, but with a weighting of the spatial field by a gaussian 'hat'-shaped pattern.
fr: Gradients simples avec pondérations gaussiennes (``SimpleGradientsWithGaussianWeights``) : comme précédemment, mais avec une pondération du champ spatial par un motif gaussien.

source: Real gradients with Gaussian weights (``RealGradientsWithGaussianWeights``): same as before, but with a weighting of the spatial field by a gaussian 'hat'-shaped pattern.
fr: Gradients réels avec pondérations gaussiennes (``RealGradientsWithGaussianWeights``) : comme précédemment, mais avec une pondération du champ spatial par un motif gaussien.

source: Simple curvature (``SimpleCurvature``): processing of the 'curvature' between adjacent grid points by ignoring the horizontal distance.
fr: Courbure simple (``SimpleCurvature``) : traitement de la 'courbure' entre des points de grille adjacents en ignorant la distance horizontale.

source: Real curvature (``RealCurvature``): processing of real 'curvature' between adjacent grid points (using the horizontal distance). This preprocessing method is automatically used when the analogy criterion is ``S2``.
fr: Courbure réelle (``RealCurvature``) : traitement de la 'courbure' réelle entre des points de grille adjacents (en utilisant la distance horizontale). Cette méthode de prétraitement est automatiquement utilisée lorsque le critère d'analogie est ``S2``.

source: Simple curvature with Gaussian weights (``SimpleCurvatureWithGaussianWeights``): same as before, but with a weighting of the spatial field by a gaussian 'hat'-shaped pattern.
fr: Courbure simple avec pondérations gaussiennes (``SimpleCurvatureWithGaussianWeights``) : comme précédemment, mais avec une pondération du champ spatial par un motif gaussien.

source: Real curvature with Gaussian weights (``RealCurvatureWithGaussianWeights``): same as before, but with a weighting of the spatial field by a gaussian 'hat'-shaped pattern.
fr: Courbure réelle avec pondérations gaussiennes (``RealCurvatureWithGaussianWeights``) : comme précédemment, mais avec une pondération du champ spatial par un motif gaussien.

source: Reanalyses
fr: Réanalyses

source: A description of the different reanalyses and the assessment of the impact of the dataset selection are presented in [Horton2018]_. AtmoSwing can read the following reanalyses (with the corresponding ID to use):
fr: Une description des différentes réanalyses et l'évaluation de l'impact de la sélection des jeux de données sont présentées dans [Horton2018]_. AtmoSwing peut lire les réanalyses suivantes (avec l'identifiant correspondant à utiliser) :

source: Use the original file names (yearly files)
fr: Utiliser les noms de fichiers originaux (fichiers annuels)

source: NCEP CFSR original Grib files: ``NCEP_CFSR``
fr: NCEP CFSR , fichiers Grib originaux : ``NCEP_CFSR``

source: Use the original file names and directory structures
fr: Utilisation des noms de fichiers et les structures de répertoires d'origine

source: NCEP CFSR `subset from NCAR/UCAR <http://rda.ucar.edu/datasets/ds093.0/index.html#!cgi-bin/datasets/getSubset?dsnum=093.0&action=customize&_da=y>`_ as netcdf files: ``NCEP_CFSR_subset``
fr: NCEP CFSR `subset du NCAR/UCAR <http://rda.ucar.edu/datasets/ds093.0/index.html#!cgi-bin/datasets/getSubset?dsnum=093.0&action=customize&_da=y>`_ sous la forme de fichiers NetCDF : ``NCEP_CFSR_subset``

source: Use the original variable name in the file name (ex: z for geopotential)
fr: Utilisation du nom de la variable originale dans le nom du fichier (ex : z pour le géopotentiel)

source: Can be structured as a single file (ex: z.nc)
fr: Peut être structuré comme un fichier unique (ex : z.nc)

source: Can be structured as yearly files (ex: z.1998.nc)
fr: Peut être structuré comme des fichiers annuels (ex : z.1998.nc)

source: Can be structured differently, but must be isolated in a directory.
fr: Peut être structuré différemment, mais doivent être isolés dans un répertoire.

source: Must be 1 file per variable with the original variable name in the file name (ex: z.nc)
fr: Il doit y avoir 1 fichier par variable avec le nom de la variable originale dans le nom du fichier (ex : z.nc)

source: Must be yearly files with the original variable name in the file name (ex: z.1998.nc)
fr: Il doit s'agir de fichiers annuels avec le nom de la variable originale dans le nom du fichier (ex : z.1998.nc)

source: NASA MERRA-2 `subset from MDISC <http://disc.sci.gsfc.nasa.gov/daac-bin/FTPSubset2.pl>`_: ``NASA_MERRA_2_subset``
fr: NASA MERRA-2 `subset du MDISC <http://disc.sci.gsfc.nasa.gov/daac-bin/FTPSubset2.pl>`_ : `NASA_MERRA_2_subset``

source: Use the original file names
fr: Utiliser les noms de fichiers originaux

source: JMA Japanese 55-year Reanalysis `subset from NCAR/UCAR <http://rda.ucar.edu/datasets/ds628.0/index.html#!cgi-bin/datasets/getSubset?dsnum=628.0&listAction=customize&_da=y>`_: ``JMA_JRA_55_subset``
fr: JMA Japanese 55-year Reanalysis `subset du NCAR/UCAR <http://rda.ucar.edu/datasets/ds628.0/index.html#!cgi-bin/datasets/getSubset?dsnum=628.0&listAction=customize&_da=y>`_ : ``JMA_JRA_55_subset``

source: JMA Japanese 55-year Reanalysis Conventional `subset from NCAR/UCAR <http://rda.ucar.edu/datasets/ds628.2/index.html#!cgi-bin/datasets/getSubset?dsnum=628.2&listAction=customize&_da=y>`_: ``JMA_JRA_55C_subset``
fr: JMA Japanese 55-year Reanalysis Conventional `subset du NCAR/UCAR <http://rda.ucar.edu/datasets/ds628.2/index.html#!cgi-bin/datasets/getSubset?dsnum=628.2&listAction=customize&_da=y>`_ : ``JMA_JRA_55C_subset``

source: Use the original file names (yearly files -- ex: z.1956.nc)
fr: Utiliser les noms de fichiers originaux (fichiers annuels -- ex : z.1956.nc)

source: Use the original file names (yearly files -- ex: z500_1956.nc)
fr: Utiliser les noms de fichiers originaux (fichiers annuels -- ex : z500_1956.nc)

source: Use the original file names (single files -- ex: sst_1deg.nc)
fr: Utiliser les noms de fichiers originaux (fichiers uniques -- ex : sst_1deg.nc)

source: :ref:`A generic NetCDF dataset <generic-dataset>`: ``Generic[__]``
fr: :ref:`Un jeu de données NetCDF générique <generic-dataset>` : ``Generic[__]``

source: :ref:`See details here <generic-dataset>`
fr: :ref:`Voir les détails ici <generic-dataset>`

source: Using AtmoSwing
fr: Utilisation d'AtmoSwing

source: AtmoSwing can be used for different purposes:
fr: AtmoSwing peut être utilisé à différentes fins :

source: in operational forecasting (the Forecaster),
fr: en prévision opérationnelle (le Forecaster),

source: to downscale climate data (the Downscaler),
fr: pour réduire l'échelle des données climatiques (le Downscaler),

source: to identify predictors for a certain predictand (the Optimizer).
fr: pour identifier les prédicteurs d'un certain prédictand (l'Optimizer).

source: For any use of AtmoSwing some data need to be prepared, and the method(s) must be calibrated. The following steps are usually required:
fr: Pour toute utilisation d'AtmoSwing, des données doivent être préparées et la (les) méthode(s) doit (doivent) être étalonnée(s). Les étapes suivantes sont généralement nécessaires :

source: Get a dataset for the predictor archive. It is often a :ref:`reanalysis dataset <reanalyses>`. The impact of the choice of the dataset is discussed in [Horton2018]_.
fr: Obtenir un jeu de données pour l'archive du prédicteur. Il s'agit souvent d'un :ref:`jeu de réanalyses <reanalyses>`. L'impact du choix du jeu de données est discuté dans [Horton2018]_.

source: Get a dataset for the target situation (NWP output for operational forecasting or GCM/RCM outputs for climate downscaling)
fr: Obtenir un jeu de données pour la situation cible (sorties NWP pour les prévisions opérationnelles ou sorties GCM/RCM pour la descente d'échelle)

source: :ref:`Format the predictand data <predictand-db>`.
fr: :ref:`Formater les données de predictand <predictand-db>`.

source: Calibrate/optimize the method using the Optimizer.
fr: Calibrer/optimiser la méthode à l'aide de l'Optimizer.

source: The datasets, predictor variables, number of analogy levels, spatial windows and most other parameters used for the analogue method are defined in the :ref:`parameters files <parameters-file>`.
fr: Les jeux de données, les variables prédictives, le nombre de niveaux d'analogie, les fenêtres spatiales et la plupart des autres paramètres utilisés pour la méthode des analogues sont définis dans les `fichiers de paramètres <parameters-file>`.

source: Predictor variables
fr: Variables prédicteurs

source: The different existing datasets do not name the meteorological variables the same way. AtmoSwing can interact with many datasets and has several of their variables defined. These datasets often provide different products, for example, for different types of levels (isobaric, isentropic, surface, etc.). As some variables can be defined for different levels (e.g., temperature), the product/level may need to be specified. Thus, the selection of a variable in the parameters file can be defined as ``level/variable``, such as ``pressure/z`` for the geopotential on pressure levels, or ``isentropic/t`` for the temperature on isentropic levels. As different level types and variables are present for different datasets, they can be named differently in AtmoSwing. For example ``pressure/z``, ``pl/h``, and ``isobaric/hgt`` are identical. The name of the level (or product) has to be the same as the corresponding subfolder name. For example, someone using NCEP/NCAR Reanalysis 1 and having a subfolder 'pressure' should then use ``pressure/z`` for the geopotential height.
fr: Les différents jeux de données existants ne nomment pas les variables météorologiques de la même manière. AtmoSwing peut interagir avec de nombreux jeux de données et contient une definition de plusieurs de leurs variables. Ces jeux de données fournissent souvent des produits différents, par exemple pour différents types de niveaux (isobarique, isentropique, surface, etc.). Comme certaines variables peuvent être définies pour différents niveaux (par exemple, la température), il peut être nécessaire de spécifier le produit/niveau. Ainsi, la sélection d'une variable dans le fichier de paramètres peut être définie comme ``niveau/variable``, par exemple ``pression/z`` pour le géopotentiel sur les niveaux de pression, ou ``isentropic/t`` pour la température sur les niveaux isentropiques. Comme différents types de niveaux et de variables sont présents pour différents jeux de données, ils peuvent être nommés différemment dans AtmoSwing. Par exemple, ``pression/z``, ``pl/h`` et ``isobaric/hgt`` sont identiques. Le nom du niveau (ou du produit) doit être identique au nom du sous-dossier correspondant. Par exemple, une personne utilisant NCEP/NCAR Reanalysis 1 et ayant un sous-dossier 'pressure' devrait utiliser ``pressure/z`` pour la hauteur géopotentielle.

source: The following sections define first the different levels, then some common variables to most datasets, and finally, list the available variables for the different datasets.
fr: Les sections suivantes définissent en premier lieu les différents niveaux, puis certaines variables communes à la plupart des jeux de données et, enfin, dressent la liste des variables disponibles pour les différents jeux de données.

source: Content of this section
fr: Contenu de cette section

source: Differentiating subsets/levels
fr: Différencier les sous-ensembles/niveaux

source: The level can usually be defined using different terms. The provided terms are interchangeable.
fr: Le niveau peut généralement être défini à l'aide de différents termes. Les termes proposés sont interchangeables.

source: **Pressure level**:
fr: **Niveau de pression** :

source: **Isentropic level**:
fr: **Niveau isentropique** :

source: **Column**:
fr: **Colonne** :

source: **Potential vorticity**:
fr: **Vorticité potentielle** :

source: Common variables
fr: Variables communes

source: Some variables are defined with different names (aliases) across the datasets:
fr: Certaines variables sont définies avec des noms différents (alias) dans les ensembles de données :

source: **Geopotential**:
fr: **Géopotentiel** :

source: When loading geopotential data, AtmoSwing automatically converts it to geopotential height.
fr: Lors du chargement des données géopotentielles, AtmoSwing les convertit automatiquement en hauteur géopotentielle.

source: **Geopotential height**:
fr: **Hauteur géopotentielle** :

source: **Air temperature**:
fr: **Température de l'air** :

source: **Relative humidity**:
fr: **Humidité relative** :

source: **Specific humidity**:
fr: **Humidité spécifique** :

source: **Vertical velocity**:
fr: **Vitesse verticale** :

source: **Precipitable water**:
fr: **Eau précipitable** :

source: **Total column water**:
fr: **Eau totale de la colonne** :

source: **Total column water vapour**:
fr: **Vapeur d'eau totale de la colonne** :

source: **Pressure**:
fr: **Pression** :

source: **Sea level pressure**:
fr: **Pression au niveau de la mer** :

source: **U wind component**:
fr: **Composante U du vent** :

source: **V wind component**:
fr: **Composante V du vent** :

source: **Total precipitation**:
fr: **Précipitations totales** :

source: Variables from datasets
fr: Variables provenant de jeux de données

source: The following variables are defined in AtmoSwing for the different reanalyses. When no data ID is provided, one can use one of the variants define above.
fr: Les variables suivantes sont définies dans AtmoSwing pour les différentes réanalyses. Lorsqu'aucun identifiant de données n'est fourni, on peut utiliser l'une des variantes définies ci-dessus.

source: **For pressure levels**:
fr: **Pour les niveaux de pression** :

source: Air Temperature
fr: Température de l'air

source: Geopotential height
fr: Hauteur géopotentielle

source: Relative Humidity
fr: Humidité relative

source: Specific Humidity
fr: Humidité spécifique

source: Vertical Velocity
fr: Vitesse verticale

source: U-Wind
fr: Composante U du vent

source: V-Wind
fr: Composante V du vent

source: **For the surface**:
fr: **Pour la surface** :

source: Surface lifted index (``lftx``)
fr: Indice d'élévation de la surface (``lftx``)

source: Best (4-layer) lifted index (``lftx4``)
fr: Meilleur indice de soulèvement (4 couches) (``lftx4``)

source: Vertical velocity
fr: Vitesse verticale

source: Potential temperature (``pottmp``)
fr: Température potentielle (``pottmp``)

source: Precipitable water
fr: Eau précipitable

source: Pressure
fr: Pression

source: Relative humidity
fr: Humidité relative

source: Sea level pressure
fr: Pression au niveau de la mer

source: U-wind
fr: Composante U du vent

source: V-wind
fr: Composante V du vent

source: **For the surface fluxes**:
fr: **Pour les flux de surface** :

source: Air Temperature 2m
fr: Température de l'air 2m

source: Potential evaporation rate (``pevpr``)
fr: Taux d'évaporation potentiel (``pevpr``)

source: Specific humidity at 2m (``shum``)
fr: Humidité spécifique à 2m (``shum``)

source: Soil moisture (0-10cm) (``soilw0-10``)
fr: Humidité du sol (0-10cm) (``soilw0-10``)

source: Soil moisture (10-200cm) (``soilw10-200``)
fr: Humidité du sol (10-200cm) (``soilw10-200``)

source: Skin Temperature (``sktmp``)
fr: Température de surface (``sktmp``)

source: Temperature of 0-10cm layer (``tmp0-10``)
fr: Température de la couche 0-10cm (``tmp0-10``)

source: Temperature of 10-200cm layer (``tmp10-200``)
fr: Température de la couche 10-200cm (``tmp10-200``)

source: Temperature at 300cm (``tmp300``)
fr: Température à 300 cm (``tmp300``)

source: U-wind at 10 m
fr: Composante U du vent à 10 m

source: V-wind at 10 m
fr: Composante V du vent à 10 m

source: Water equiv. of snow dept (``weasd``)
fr: Équivalent en eau de la neige (``weasd``)

source: Maximum temperature at 2m (``tmax2m``)
fr: Température maximale à 2m (``tmax2m``)

source: Minimum temperature at 2m (``tmin2m``)
fr: Température minimale à 2m (``tmin2m``)

source: Cloud forcing net longwave flux (``cfnlf``)
fr: Flux net d'ondes longues du forçage des nuages (``cfnlf``)

source: Cloud forcing net solar flux (``cfnsf``)
fr: Flux solaire net de forçage des nuages (``cfnsf``)

source: Convective precipitation rate (``cprat``)
fr: Taux de précipitations convectives (``cprat``)

source: Clear sky downward longwave flux (``csdlf``)
fr: Flux d'ondes longues descendantes par ciel clair (``csdlf``)

source: Clear sky downward solar flux (``csdsf``)
fr: Flux solaire descendant par ciel clair (``csdsf``)
