Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/getting-started.po
Languages: fr

source: Clear sky upward solar flux at surface (``csusf``)
fr: Flux solaire ascendant à la surface par ciel clair (``csusf``)

source: Downward longwave radiation flux (``dlwrf``)
fr: Flux de rayonnement descendant de grande longueur d'onde (``dlwrf``)

source: Downward solar radiation flux (``dswrf``)
fr: Flux de rayonnement solaire descendant (``dswrf``)

source: Ground heat flux (``gflux``)
fr: Flux de chaleur du sol (``gflux``)

source: Latent heat net flux (``lhtfl``)
fr: Flux net de chaleur latente (``lhtfl``)

source: Near IR beam downward solar flux (``nbdsf``)
fr: Flux solaire descendant du faisceau proche IR (``nbdsf``)

source: Near IR diffuse downward solar flux (``nddsf``)
fr: Flux solaire descendant diffus dans le proche IR (``nddsf``)

source: Net longwave radiation (``nlwrs``)
fr: Rayonnement net de grande longueur d'onde (``nlwrs``)

source: Net shortwave radiation (``nswrs``)
fr: Rayonnement net d'ondes courtes (``nswrs``)

source: Precipitation rate
fr: Taux de précipitations

source: Sensible heat net flux (``shtfl``)
fr: Flux net de chaleur sensible (``shtfl``)

source: Momentum flux (zonal) (``uflx``)
fr: Flux de quantité de mouvement (zonal) (``uflx``)

source: Zonal gravity wave stress (``ugwd``)
fr: Contrainte d'onde de gravité zonale (``ugwd``)

source: Upward Longwave Radiation Flux (``ulwrf``)
fr: Flux ascendant de rayonnement de grande longueur d'onde (``ulwrf``)

source: Upward Solar Radiation Flux (``uswrf``)
fr: Flux de rayonnement solaire ascendant (``uswrf``)

source: Visible Beam Downward Solar Flux (``vbdsf``)
fr: Flux solaire descendant du faisceau visible (`vbdsf`)

source: Visible Diffuse Downward Solar Flux (``vddsf``)
fr: Flux solaire visible diffus descendant (`vddsf`)

source: Momentum Flux, v-component (``vflx``)
fr: Flux de Momentum, composante v (``vflx``)

source: Meridional Gravity Wave Stress (``vgwd``)
fr: Contrainte d'onde de gravité méridienne (``vgwd``)

source: Total cloud cover (``tcdc``)
fr: Couverture nuageuse totale (``tcdc``)

source: Momentum Flux (meridional) (``vflx``)
fr: Flux de Momentum (méridional) (``vflx``)

source: **For pressure levels** (``pgbh``):
fr: **Pour les niveaux de pression** (``pgbh``) :

source: Mean sea level pressure
fr: Pression au niveau moyen de la mer

source: Geopotential height anomaly (``gpa``)
fr: Anomalie de hauteur géopotentielle (``gpa``)

source: Specific humidity
fr: Humidité spécifique

source: Eastward wind
fr: Vent d'est

source: Northward wind
fr: Vent du nord

source: Atmosphere horizontal velocity potential (``vpot``)
fr: Potentiel de vitesse horizontale de l'atmosphère (``vpot``)

source: 5-wave geopotential height (``5wavh``)
fr: Hauteur géopotentielle à 5 ondes (``5wavh``)

source: 5-wave geopotential height anomaly (``5wava``)
fr: Anomalie de hauteur géopotentielle à 5 ondes (``5wava``)

source: Atmosphere absolute vorticity (``absv``)
fr: Vorticité absolue de l'atmosphère (``absv``)

source: Cloud water mixing ratio (``clwmr``)
fr: Taux de mélange de l'eau dans les nuages (``clwmr``)

source: Atmosphere horizontal streamfunction (``strm``)
fr: Fonction horizontale de l'atmosphère (``strm``)

source: **For the total column**:
fr: **Pour la colonne totale**:

source: Cloud water (``cwat``)
fr: Eau de nuage (``cwat``)

source: Atmosphere water vapor content (``pwat``)
fr: Contenu en vapeur d'eau de l'atmosphère (``pwat``)

source: Potential vorticity
fr: Vorticité potentielle

source: U component of wind
fr: Composante U du vent

source: V component of wind
fr: Composante V du vent

source: Vorticity (relative) (``vo``)
fr: Vorticité (relative) (``vo``)

source: Geopotential
fr: Géopotentiel

source: **For surface**:
fr: **Pour la surface** :

source: 2 meter dewpoint temperature (``d2m``)
fr: Température du point de rosée à 2 mètres (``d2m``)

source: Sea level pressure (``msl``)
fr: Pression au niveau de la mer (``msl``)

source: Snow depth (``sd``)
fr: Épaisseur de neige (``sd``)

source: Sea surface temperature (``sst``)
fr: Température de surface de la mer (``sst``)

source: 2 meter temperature (``t2m``)
fr: Température à 2 mètres (``t2m``)

source: Total column water (``tcw``)
fr: Eau totale de la colonne (``tcw``)

source: Total column water vapor (``tcwv``)
fr: Vapeur d'eau totale de la colonne (``tcwv``)

source: 10 meter U wind component (``u10``)
fr: Composante U du vent à 10 mètres (``u10``)

source: 10 meter V wind component (``v10``)
fr: Composante V du vent à 10 mètres (``v10``)

source: Total precipitation (``tp``)
fr: Précipitations totales (``tp``)

source: Convective available potential energy (``cape``)
fr: Énergie potentielle de convection disponible (``cape``)

source: Instantaneous moisture flux (``ie``)
fr: Flux d'humidité instantané (``ie``)

source: Surface net solar radiation (``ssr``)
fr: Rayonnement solaire net de surface (``ssr``)

source: Surface solar radiation downwards (``ssrd``)
fr: Rayonnement solaire descendant de surface (``ssrd``)

source: Surface net thermal radiation (``str``)
fr: Rayonnement thermique net de la surface (``str``)

source: Surface thermal radiation downwards (``strd``)
fr: Rayonnement thermique descendant de surface (``strd``)

source: **For isentropic levels**:
fr: **Pour les niveaux isentropiques** :

source: Montgomery potential (``mont``)
fr: Potentiel de Montgomery (``mont``)

source: Total precipitation
fr: Précipitations totales

source: **For PV levels**:
fr: **Pour les niveaux de PV** :

source: Potential temperature (``pt``)
fr: Température potentielle (``pt``)

source: Total column water
fr: Total de la colonne d'eau

source: Geopotential (``z``)
fr: Géopotentiel (``z``)

source: Geopotential height (``gh``)
fr: Hauteur géopotentielle (``gh``)

source: Air temperature
fr: Température de l'air

source: Total column water vapour (``tcwv``)
fr: Vapeur d'eau totale de la colonne (``tcwv``)

source: **For product 'inst6_3d_ana_Np'**:
fr: **Pour le produit 'inst6_3d_ana_Np'** :

source: Sea-level pressure
fr: Pression au niveau de la mer

source: Eastward wind component
fr: Composante est du vent

source: Northward wind component
fr: Composante nord du vent

source: Surface pressure (``ps``)
fr: Pression de surface (``ps``)

source: **For product 'inst3_3d_asm_Np'**:
fr: **Pour le produit 'inst3_3d_asm_Np'** :

source: Ertel's potential vorticity
fr: Vorticité potentielle d'Ertel

source: Vertical pressure velocity
fr: Vitesse de pression verticale

source: Relative humidity after moist
fr: Humidité relative après humidification

source: **For product 'inst1_2d_int_Nx'**:
fr: **Pour le produit 'inst1_2d_int_Nx'** :

source: Total precipitable ice water (``tqi``)
fr: Eau gelée précipitable totale (``tqi``)

source: Total precipitable liquid water (``tql``)
fr: Eau liquide précipitable totale (``tql``)

source: Total precipitable water vapor (``tqv``)
fr: Vapeur d'eau précipitable totale (``tqv``)

source: **For product 'inst1_2d_asm_Nx'**:
fr: **Pour le produit 'inst1_2d_asm_Nx'** :

source: 10-meter air temperature (``t10m``)
fr: Température de l'air à 10 mètres (``t10m``)

source: **For product 'tavg1_2d_flx_Nx'**:
fr: **Pour le produit 'tavg1_2d_flx_Nx'** :

source: Total surface precipitation flux
fr: Flux total de précipitations de surface

source: **For product 'tavg1_2d_lnd_Nx'**:
fr: **Pour le produit 'tavg1_2d_lnd_Nx'** :

source: Total precipitation land; bias corrected
fr: Précipitations totales, avec biais corrigés

source: **For pressure levels** (anl_p125):
fr: **Pour les niveaux de pression** (anl_p125) :

source: **For the surface** (anl_surf125):
fr: **Pour la surface** (anl_surf125) :

source: Pressure reduced to MSL
fr: Pression réduite au niveau de la mer

source: **For the total column** (anl_column125):
fr: **Pour la colonne totale** (anl_column125) :

source: Geopotential Height
fr: Hauteur géopotentielle

source: **For product 'fcst_phy2m125'**:
fr: **Pour le produit 'fcst_phy2m125'** :

source: Total precipitation 3h (``tprat3h``)
fr: Précipitations totales 3h (``tprat3h``)

source: Total precipitation 6h (``tprat6h``)
fr: Précipitations totales 6h (``tprat6h``)

source: **For surface fluxes**:
fr: **Pour les flux de surface** :

source: **For the product 'analysis'**:
fr: **Pour le produit 'analyse'** :

source: Vertical velocity at 500 hPa (``omega500``)
fr: Vitesse verticale à 500 hPa (``omega500``)

source: Relative Humidity at 850 hPa (``rh850``)
fr: Humidité relative à 850 hPa (``rh850``)

source: Relative Humidity at the pressure level 0.995 times the surface pressure (``rh9950``)
fr: Humidité relative au niveau de pression 0.995 fois la pression de surface (``rh9950``)

source: Air Temperature at 850 hPa(``t850``)
fr: Température de l'air à 850 hPa (``t850``)

source: Air Temperature at the pressure level 0.995 times the surface pressure (``t9950``)
fr: Température de l'air au niveau de pression 0.995 fois la pression de surface (``t9950``)

source: Geopotential height at 200 hPa (``z200``)
fr: Hauteur géopotentielle à 200 hPa (``z200``)

source: Geopotential height at 500 hPa (``z500``)
fr: Hauteur géopotentielle à 500 hPa (``z500``)

source: Geopotential height at 1000 hPa (``z1000``)
fr: Hauteur géopotentielle à 1000 hPa (``z1000``)

source: **For the product 'first_guess'**:
fr: **Pour le produit 'first_guess'** :

source: There are no product/level definition for this dataset.
fr: Il n'y a pas de définition de produit/niveau pour ce jeu de données.

source: Sea Surface Temperature (``sst``)
fr: Température de surface de la mer (``sst``)

source: Sea Surface Temperature Anomaly (``sst_anom``)
fr: Anomalie de température de surface de la mer (``sst_anom``)

source: Total column water vapour
fr: Vapeur d'eau totale de la colonne

source: Generic NetCDF
fr: NetCDF générique

source: The generic dataset is different from the other datasets. There is no predefined variables. The variable name needs to be used in the NetCDF file.
fr: Le jeu de données générique est différent des autres jeux de données. Il n'y a pas de variables prédéfinies. Le nom de la variable doit être utilisé dans le fichier NetCDF.

source: Versioning scheme and migration
fr: Schéma de versionnage et migration

source: Versioning scheme
fr: Schéma de versionnage

source: AtmoSwing follows a versioning structure with version numbers as MAJOR.MINOR.PATCH. The rules are the following:
fr: AtmoSwing suit une structure de versionnage dont les numéros de version sont MAJOR.MINOR.PATCH. Les règles sont les suivantes :

source: MAJOR version: significant changes in the overall structure or addition of a new tool,
fr: Version MAJEURE : changements significatifs dans la structure générale ou ajout d'un nouvel outil,

source: MINOR version: addition of functionality that might be backward-incompatible,
fr: Version MINOR : ajout de fonctionnalités susceptibles d'être incompatibles avec les versions précédentes,

source: PATCH version: backward-compatible bug fixes and small improvements.
fr: Version PATCH : corrections de bogues et petites améliorations.

source: Support Policy
fr: Politique de support

source: When a new version is published, the development of previous versions is not continued, except for LTS (Long Term Support) releases, where bug fixes are provided for a longer period.
fr: Lorsqu'une nouvelle version est publiée, le développement des versions précédentes n'est pas poursuivi, à l'exception des versions LTS (Long Term Support), pour lesquelles des corrections de bogues sont fournies pendant une période plus longue.

source: Release
fr: Distribution

source: Bug Fixes Until
fr: Corrections de bugs jusqu'à

source: Upgrade Guide
fr: Guide de mise à niveau

source: v2.1 to v3.0
fr: v2.1 à v3.0

source: **Parameters files**
fr: **Fichiers de paramètres**

source: Changes to the predictors ``dataset_id`` for the Forecaster. Check the new values under the :ref:`Forecaster data page<data-forecaster>`.
fr: Modification des ``dataset_id`` des prédicteurs pour le Forecaster. Vérifiez les nouvelles valeurs sous :ref:`la page des données du Forecaster<data-forecaster>`.

source: **Predictand DB**
fr: **La base de données des prédictands**

source: The predictand DB has been updated to include the projection information. The DB must be generated again with the new version of the software.
fr: La base de données des predictands a été mise à jour pour inclure les informations de projection. La BD doit être générée à nouveau avec la nouvelle version du logiciel.

source: **Forecaster batch file**
fr: **Fichier batch du Forecaster**

source: The extension of the batch file has changed to ``.xml``.
fr: L'extension du fichier batch est maintenant ``.xml``.

source: v2.0 to v2.1
fr: v2.0 à v2.1

source: Changes to the reanalyses ``dataset_id``. Check the new values under the :ref:`reanalyses page<reanalyses>`.
fr: Changements dans le ``dataset_id`` des réanalyses. Vérifiez les nouvelles valeurs sous :ref:`reanalyses page<reanalyses>`.
