Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/getting-started.po
Languages: fr

source: Getting started
fr: Démarrer

source: This section contains documentation on how to get started with AtmoSwing. This document can also be downloaded as a pdf or epub using the bottom left menu.
fr: Cette section contient la documentation sur la mise en route d'AtmoSwing. Ce document peut également être téléchargé au format pdf ou epub en utilisant le menu en bas à gauche.

source: This section is divided into the following topics:
fr: Cette section est divisée en plusieurs rubriques :

source: Some analog methods
fr: Quelques méthodes des analogues

source: Different variants of AMs are presented here. These methods have varying degrees of complexity and comprise one or more subsequent levels of analogy with predictor variables of different kinds. The following content comes from [Horton2018]_.
fr: Différentes variantes de méthode des analogues sont présentées ici. Ces méthodes ont des degrés de complexité variables et comprennent un ou plusieurs niveaux d'analogie avec des variables de différentes natures. Le contenu suivant provient de [Horton2018]_.

source: The first method developed with NCEP/NCAR Reanalysis 1 by [Bontron2004]_ is based on the analogy of synoptic circulation on the geopotential height at two pressure levels (Z1000 at +12 h and Z500 at +24 h) and is known here as 2Z.
fr: La première méthode développée avec les reanalyses NCEP/NCAR 1 par [Bontron2004]_ est basée sur l'analogie de la circulation synoptique sur la hauteur du géopotentiel à deux niveaux de pression (Z1000 à +12 h et Z500 à +24 h) et est ici nommée 2Z.

source: The 2Z method consists of the following steps: firstly, to cope with seasonal effects, candidate dates are extracted from the archive period within four months centered around the target date, for every year of the archive (PC: preselection on a calendar basis in Table below). Then, the analogy of the atmospheric circulation of a target date with every day from the preselection set (excluding +-30 days around the target date and an eventual validation period) is assessed by processing the S1 criterion ([Teweles1954]_, [Brown2012]_), which is a comparison of gradients, over a defined spatial window (the domain on which the predictors are compared). S1 is processed on each level, and the average is then considered, here with the same weights.
fr: La méthode 2Z comprend les étapes suivantes : tout d'abord, pour tenir compte des effets saisonniers, des dates candidates sont extraites de la période d'archive dans les quatre mois centrés sur la date cible, pour chaque année de l'archive (PC : présélection sur une base calendaire dans le tableau ci-dessous). Ensuite, l'analogie de la circulation atmosphérique d'une date cible avec chaque jour de la présélection (excluant +-30 jours autour de la date cible et une éventuelle période de validation) est évaluée en calculant le critère S1 ([Teweles1954]_, [Brown2012]_), qui est une comparaison de gradients, sur une fenêtre spatiale définie (le domaine sur lequel les prédicteurs sont comparés). Le critère S1 est calculé pour chaque niveau, puis moyenné.

source: where :math:`\Delta \hat{z}_{i}` is the difference in geopotential height between the i-th pair of adjacent points of gridded data describing the target situation, and :math:`\Delta z_{i}` is the corresponding observed geopotential height difference in the candidate situation. The smaller the values S1 are, the more similar the pressure fields.
fr: où :math:`\Delta \hat{z}_{i}` est la différence de hauteur géopotentielle entre la i-ième paire de points adjacents de données maillées décrivant la situation cible, et :math:\Delta z_{i}` est la différence de hauteur géopotentielle observée correspondante pour la situation candidate. Plus les valeurs S1 sont petites, plus les champs de pression sont similaires.

source: The N1 dates, where N1 is a parameter to be calibrated, with the lowest values of S1 are considered as analogs to the target date. Then, the daily observed precipitation values of the N1 selected dates provide the empirical conditional distribution, considered as the probabilistic prediction for the target date.
fr: Les N1 dates, où N1 est un paramètre à calibrer, avec les valeurs les plus faibles de S1 sont considérées comme analogues à la date cible. Ensuite, les valeurs de précipitations quotidiennes observées pour les N1 dates sélectionnées fournissent la distribution conditionnelle empirique, considérée comme la prédiction probabiliste pour la date cible.

source: Another method relying only on atmospheric circulation is based on the geopotential height on four combinations of pressure levels and temporal windows (4Z, Table below) at levels that were automatically selected by genetic algorithms for the upper Rhone catchment in Switzerland [Horton2017b]_. The 4Z method was shown to outperform 2Z by exploiting more information from the geopotential height and by taking advantage of additional degrees of freedom, such as different spatial windows between the pressure levels and the introduction of weighting between them. However, the 4Z method presented here is a simplification of the results from [Horton2017b]_, and only the selection of the optimal pressure levels and temporal windows are shown (Z1000 at +06 h and +30 h, Z700 at +24 h, and Z500 at +12 h).
fr: Une autre méthode reposant uniquement sur la circulation atmosphérique est basée sur la hauteur géopotentielle sur quatre combinaisons de niveaux de pression et de fenêtres temporelles (4Z, tableau ci-dessous) à des niveaux qui ont été automatiquement sélectionnés par des algorithmes génétiques pour le bassin versant du Rhône supérieur en Suisse [Horton2017b]_. La méthode 4Z s'est avérée plus performante que la méthode 2Z en exploitant davantage d'informations provenant de la hauteur du champ géopotentielle et en tirant parti de degrés de liberté supplémentaires, tels que différentes fenêtres spatiales entre les niveaux de pression et l'introduction d'une pondération entre eux. Cependant, la méthode 4Z présentée ici est une simplification des résultats de [Horton2017b]_, et seule la sélection des niveaux de pression et des fenêtres temporelles optimales est présentée (Z1000 à +06 h et +30 h, Z700 à +24 h, et Z500 à +12 h).

source: The other methods considered hereafter add a second, or more, subsequent level(s) of analogy after the analogy of the atmospheric circulation, in a stepwise manner.
fr: Les autres méthodes considérées ci-après ajoutent un deuxième ou plusieurs niveaux d'analogie après l'analogie de la circulation atmosphérique, de manière progressive.

source: The next method adds a second level of analogy with moisture variables (method 2Z-2MI, Table below), using a moisture index (MI), which is the product of the total precipitable water (TPW) and the relative humidity at 850 hPa (RH850) [Bontron2004]_. When adding a second level of analogy, N2 dates are subsampled from the N1 analogs of the atmospheric circulation, to end up with a smaller number of analog situations. When this second level of analogy is added, a higher number of analogs N1 is kept at the first level.
fr: La méthode suivante ajoute un deuxième niveau d'analogie avec les variables d'humidité (méthode 2Z-2MI, tableau ci-dessous), en utilisant un indice d'humidité (MI), qui est le produit de l'eau précipitable totale (TPW) et de l'humidité relative à 850 hPa (RH850) [Bontron2004]_. Lors de l'ajout d'un deuxième niveau d'analogie, les dates N2 sont sous-échantillonnées à partir des analogues N1 de la circulation atmosphérique, afin d'obtenir un nombre réduit de situations analogues. Lorsque ce deuxième niveau d'analogie est ajouté, un plus grand nombre d'analogues N1 est sélectionné lors du premier niveau.

source: Similar to the 4Z method, the 4Z-2MI is a simplification of the methods optimized by genetic algorithms in [Horton2017b]_. It consists of a first level of analogy on the geopotential height at four pressure levels (Z1000 at +30 h, Z850 at +12 h, Z700 at +24 h, and Z400 at +12 h), different from 4Z, followed by the moisture index (MI) at two pressure levels (MI700 at +24 h and MI600 at +12 h).
fr: De manière similaire à la méthode 4Z, la méthode 4Z-2MI est une simplification des méthodes optimisées par algorithmes génétiques de [Horton2017b]_. Elle consiste en un premier niveau d'analogie sur la hauteur du géopotentiel à quatre niveaux de pression (Z1000 à +30 h, Z850 à +12 h, Z700 à +24 h et Z400 à +12 h), différents de 4Z, suivi de l'indice d'humidité (MI) à deux niveaux de pression (MI700 à +24 h et MI600 à +12 h).

source: To constrain the seasonal effect, [BenDaoud2016]_ replaced the calendar preselection (+- 60 days around the target date) by a preselection based on similarity of air temperature (T925 at +36 h and T600 at +12 h, at the nearest grid point). It allows a more dynamic screening of similar situations in terms of air masses as the seasonal signal is also present in the temperature data. The undesired mixing of spring and autumn situations is discussed in [Caillouet2016]_. The number of preselected dates (N0) is equivalent to the number of days selected with the calendar approach and thus depends on the archive size. In this method, named PT-2Z-4MI, the analogy of the atmospheric circulation is the same as in the 2Z method, but the moisture analogy is different (MI925 and MI700 at +12 h and 24 h).
fr: Pour contraindre l'effet saisonnier, [BenDaoud2016]_ a remplacé la présélection calendaire (+- 60 jours autour de la date cible) par une présélection basée sur la similarité des températures de l'air (T925 à +36 h et T600 à +12 h, au point de grille le plus proche). Cela permet une sélection plus dynamique de situations similaires en termes de masses d'air, car le signal saisonnier est également présent dans les données de température. Le mélange indésirable de situations printanières et automnales est discuté dans [Caillouet2016]_. Le nombre de dates présélectionnées (N0) est équivalent au nombre de jours sélectionnés avec l'approche calendaire et dépend donc de la taille des archives. Dans cette méthode, nommée PT-2Z-4MI, l'analogie de la circulation atmosphérique est la même que dans la méthode 2Z, mais l'analogie de l'humidité est différente (MI925 et MI700 à +12 h et 24 h).

source: Subsequently, [BenDaoud2016]_ introduced an additional level of analogy between the circulation and the moisture analogy (PT-2Z-4W-4MI, Table below), based on the vertical velocity at 850 hPa (W850). This AM, named "SANDHY" for Stepwise Analogue Downscaling method for Hydrology ([BenDaoud2016]_ [Caillouet2016]_), was primarily developed for large and relatively flat/lowland catchments in France (Saône, Seine). It has also been applied to the whole France territory by [Radanovics2013]_ with ERA-40 and by [Caillouet2016]_ with 20CR-V2b.
fr: Par la suite, [BenDaoud2016]_ a introduit un niveau supplémentaire d'analogie entre la circulation et l'analogie de l'humidité (PT-2Z-4W-4MI, tableau ci-dessous), basé sur la vitesse verticale à 850 hPa (W850). Cette MA, appelée "SANDHY" pour Stepwise Analogue Downscaling method for Hydrology ([BenDaoud2016]_ [Caillouet2016]_), a été principalement développée pour des bassins de grande taille et relativement plats en France (Saône, Seine). Elle a également été appliquée à l'ensemble du territoire français par [Radanovics2013]_ avec ERA-40 et par [Caillouet2016]_ avec 20CR-V2b.

source: Some analog methods listed by increasing complexity. P0 is the preselection (PC: on a calendar basis, that is, +-60 days around the target date), L1, L2, and L3 are the subsequent levels of analogy. The meteorological variables are: SLP -- mean sea level pressure, Z -- geopotential height, T -- air temperature, W -- vertical velocity, MI -- moisture index, which is the product of the relative humidity at the given pressure level and the total water column. The analogy criterion is S1 for SLP and Z and RMSE for the other variables.
fr: Quelques méthodes des analogues classées par complexité croissante. P0 est la présélection (PC : sur une base calendaire, c'est-à-dire +-60 jours autour de la date cible), L1, L2 et L3 sont les niveaux d'analogie consécutifs. Les variables météorologiques sont les suivantes : SLP -- pression moyenne au niveau de la mer, Z -- hauteur géopotentielle, T -- température de l'air, W -- vitesse verticale, MI -- indice d'humidité, qui est le produit de l'humidité relative au niveau de pression donné et de la colonne d'eau totale. Le critère d'analogie est S1 pour SLP et Z, et RMSE pour les autres variables.

source: Method
fr: Méthode

source: Analogy criteria
fr: Critères d'analogie

source: The analogy criteria available in AtmoSwing are the following:
fr: Les critères d'analogie disponibles dans AtmoSwing sont les suivants :

source: Teweles-Wobus with Gaussian weights (``S1G``)
fr: Teweles-Wobus avec poids gaussiens (``S1G``)

source: Teweles-Wobus on raw data (``S0``)
fr: Teweles-Wobus sur données brutes (``S0``)

source: Derivative of Teweles-Wobus (``S2``)
fr: Dérivée de Teweles-Wobus (``S2``)

source: Sum of absolute differences (``SAD``)
fr: Somme des différences absolues (``SAD``)

source: Mean absolute difference (``MD``)
fr: Différence moyenne absolue (``MD``)

source: Root mean square error (``RMSE``)
fr: Erreur quadratique moyenne (``RMSE``)

source: Difference in mean value (nonspatial) (``DMV``)
fr: Différence de valeur moyenne (non spatiale) (``DMV``)

source: Difference in standard deviation (nonspatial) (``DSD``)
fr: Différence d'écart-type (non spatial) (``DSD``)

source: Data
fr: Données

source: This section describes the data required for AtmoSwing. It is divided into the following topics:
fr: Cette section décrit les données nécessaires à AtmoSwing. Elle est divisée en plusieurs rubriques :

source: Downscaler specific data
fr: Données spécifiques au Downscaler

source: AtmoSwing Downscaler can read the following climate data in addition to reanalyses datasets (with the corresponding ID to use):
fr: AtmoSwing Downscaler peut lire les données climatiques suivantes en plus des jeux de données réanalysées (avec l'ID correspondant à utiliser) :

source: Forecaster specific data
fr: Données spécifiques au Forecaster

source: AtmoSwing Forecaster can read the following NWP outputs (with the corresponding ID to use):
fr: AtmoSwing Forecaster peut lire les sorties de modèles numériques suivantes (avec l'ID correspondant à utiliser) :

source: NWS GFS forecasts (automatically downloaded from `NOMADS <https://nomads.ncep.noaa.gov/>`_): ``NWS_GFS``
fr: Prévisions NWS GFS (téléchargées automatiquement depuis `NOMADS <https://nomads.ncep.noaa.gov/>`_) : ``NWS_GFS``

source: NWS GFS forecasts, but without download: ``NWS_GFS_Local``
fr: Prévisions NWS GFS, mais sans téléchargement : ``NWS_GFS_Local``

source: ECMWF IFS forecasts (no automatic download): ``ECMWF_IFS``
fr: Prévisions IFS du CEPMMT (pas de téléchargement automatique) : ``ECMWF_IFS``

source: Météo-France ARPEGE forecasts (no automatic download): ``MF_ARPEGE``
fr: Prévisions ARPEGE de Météo-France (pas de téléchargement automatique) : ``MF_ARPEGE``

source: Specify the domain to download
fr: Indiquer le domaine à télécharger

source: When choosing GFS, the predictors are downloaded for the European domain by default: longitude from -32° to 42° and latitude from 20° to 72°. The domain can be changed in the AtmoSwingForecaster.ini file.
fr: Lorsque GFS est utilisé, les prédicteurs sont téléchargés par défaut pour le domaine européen : longitude de -32° à 42° et latitude de 20° à 72°. Le domaine peut être modifié dans le fichier AtmoSwingForecaster.ini.

source: The default domain and levels to be downloaded are specified in the URLs in AtmoSwingForecaster.ini (under your profile directory; typically C:\\Users\\<username>\\AppData\\Roaming\\AtmoSwing for Windows or .AtmoSwing for Linux/OSX). The domain is adjusted by changing the values of ``leftlon=-32&rightlon=42&toplat=72&bottomlat=20``, and the levels with ``lev_XXX_mb=on``.
fr: Le domaine et les niveaux par défaut à télécharger sont spécifiés dans les URL d'AtmoSwingForecaster.ini (dans votre répertoire de profil ; typiquement C:\\Users\\<username>\\AppData\\Roaming\\AtmoSwing pour Windows ou .AtmoSwing pour Linux/OSX). Le domaine est ajusté en changeant les valeurs de ``leftlon=-32&amp;rightlon=42&amp;toplat=72&amp;bottomlat=20``, et les niveaux avec ``lev_XXX_mb=on``.

source: Generic dataset
fr: Jeu de données générique

source: In addition to the multiple reanalyses supported, AtmoSwing allows using a generic dataset as NetCDF files. The dataset can be named as follows:
fr: En plus des multiples réanalyses prises en charge, AtmoSwing permet d'utiliser un jeu de données générique sous forme de fichiers NetCDF. Le jeu de données peut être nommé comme suit :

source: ``Generic``: simple name to be used mainly when the generic dataset is issued from a single source.
fr: ``Generic`` : nom simple à utiliser principalement lorsque le jeu de données générique provient d'une source unique.

source: ``Generic[__]``: the name can also be composed of the term ``Generic`` and any other suffix. It allows specifying the source of the dataset (for example ``Generic_ERA5`` or ``Generic_CFSR``). This is mainly useful for the Viewer to differentiate the datasets.
fr: ``Generic[__]`` : le nom peut également être composé du terme ``Generic`` et de tout autre suffixe. Il permet de spécifier la source du jeu de données (par exemple ``Generic_ERA5`` ou ``Generic_CFSR``). Ceci est principalement utile pour le Viewer afin de différencier les jeux de données qui ont été utilisés.

source: The files can be organized as follows (AtmoSwing will look for possible matches):
fr: Les fichiers peuvent être organisés comme suit (AtmoSwing recherchera les correspondances possibles) :

source: A single file with the name of the desired predictor variable (ex: rh.nc)
fr: Un seul fichier avec le nom de la variable prédictive souhaitée (ex : rh.nc)

source: Yearly files with the year in the file name
fr: Fichiers annuels avec l'année dans le nom du fichier

source: All the files in a directory. The files need to be named in order to be sorted chronologically.
fr: Tous les fichiers d'un répertoire. Les fichiers doivent être nommés afin d'être triés chronologiquement.

source: File structure
fr: Structure du fichier

source: The file needs to have four dimensions:
fr: Le fichier doit avoir quatre dimensions :

source: level: needs to be defined even if there is no level (set to 0 in this case)
fr: level : doit être défini même s'il n'y a pas de niveau (fixé à 0 dans ce cas)

source: time: needs to be expressed as Modified Julian Date (``days since 1858-11-17 00:00:00.0 +0:00``)
fr: time : doit être défini en tant que Modified Julian Date (``days since 1858-11-17 00:00:00.0 +0:00``)

source: The generic dataset is different from the other datasets as there are no predefined variables. The name given to the variable must also be used in the xml parameters file.
fr: Le jeu de données générique est différent des autres jeux de données car il n'y a pas de variables prédéfinies. Le nom donné à la variable (dans le fichier NetCDF) doit également être utilisé dans le fichier de paramètres xml.

source: Generate generic datasets
fr: Générer des jeux de données génériques

source: The `AtmoSwing Python toolbox repository <https://github.com/atmoswing/atmoswing-python-toolbox>`_ contains scripts to convert some reanalyses to the generic format (for example `scripts/createGenericFromERAI.py <https://github.com/atmoswing/atmoswing-python-toolbox/blob/main/examples/create_generic_from_ERAI.py>`_).
fr: Le dépôt de `AtmoSwing Python toolbox <https://github.com/atmoswing/atmoswing-python-toolbox>`_ contient des scripts pour convertir certaines réanalyses au format générique (par exemple `scripts/createGenericFromERAI.py <https://github.com/atmoswing/atmoswing-python-toolbox/blob/main/examples/create_generic_from_ERAI.py>`_).

source: One must specify:
fr: Il faut préciser :

source: ``dir_origin``: the directory containing the original files
fr: ``dir_origin`` : le répertoire contenant les fichiers originaux

source: ``dir_target``: the directory to save the resulting files
fr: ``dir_target`` : le répertoire dans lequel les fichiers résultants doivent être sauvegardés

source: ``files_list``: a list of the files to transform containing the following entries: 1) the subdirectory containing the original files (for example ``pressure`` or ``surface_analysis``), 2) the name of the variable in the original files, 3) the name given to the variable in the resulting file.
fr: ``files_list`` : une liste des fichiers à transformer contenant les entrées suivantes : 1) le sous-répertoire contenant les fichiers originaux (par exemple ``pressure`` ou ``surface_analysis``), 2) le nom de la variable dans les fichiers originaux, 3) le nom à donner à la variable dans le fichier résultant.

source: The scripts might need to be modified to suit other input formats or structures.
fr: Il peut être nécessaire de modifier les scripts pour les adapter à d'autres formats ou structures d'entrée.

source: Executables can be downloaded on `AtmoSwing release page <https://github.com/atmoswing/atmoswing/releases>`_. There are two versions available:
fr: Les exécutables peuvent être téléchargés sur la page `AtmoSwing release <https://github.com/atmoswing/atmoswing/releases>`_. Deux versions sont disponibles :

source: The desktop version: contains all four tools with a graphical user interface (GUI). This version is suited for desktop PCs.
fr: La version de bureau : contient les quatre outils avec une interface utilisateur graphique (GUI). Cette version est adaptée aux PC de bureau.

source: The server version: contains the Forecaster, the Downscaler, and the Optimizer without GUI. The Viewer is not included. This version is suited for use on servers through a command-line interface.
fr: La version serveur : contient le Forecaster, le Downscaler, et l'Optimizer sans GUI. Le Viewer n'est pas inclus. Cette version est adaptée à une utilisation sur des serveurs via une interface de ligne de commande.

source: The .msi is a Windows installer, and the .zip contains the executable without installer.
fr: Le fichier .msi est un programme d'installation Windows, et le fichier .zip contient l'exécutable sans programme d'installation.

source: AtmoSwing needs to be compiled on Linux. Instructions are provided on the `AtmoSwing wiki <https://github.com/atmoswing/atmoswing/wiki>`_.
fr: AtmoSwing doit être compilé sous Linux. Des instructions sont fournies sur le `wiki d'AtmoSwing <https://github.com/atmoswing/atmoswing/wiki>`_.

source: Parameters file
fr: Fichier de paramètres

source: The parameters files are essential elements in AtmoSwing as they define the structure of the analog method to use. It is where one defines the datasets, the predictor variables, the number of analogy levels, the spatial windows, etc... Some elements vary between the Forecaster, the Optimizer, and the Downscaler, and thus the target module must be specified in the root tag (ex: ``<atmoswing version="1.0" target="optimizer">``).
fr: Les fichiers de paramètres sont des éléments essentiels d'AtmoSwing car ils définissent la structure de la méthode des analogues à utiliser. C'est là que l'on définit les jeux de données, les variables prédictives, le nombre de niveaux d'analogie, les fenêtres spatiales, etc... Certains éléments varient entre le Forecaster, l'Optimizer, et le Downscaler, et donc le module cible doit être spécifié dans la balise racine (ex : ``<atmoswing version="1.0" target="optimizer">``).
