Repository: atmoswing/atmoswing-user-manual
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Content
fr: Contenu

source: AtmoSwing's user documentation
fr: Documentation utilisateur d'AtmoSwing

source: :ref:`Analog methods (AMs) <analog-methods>` are statistical weather forecasting methods, which use synoptic-scale predictors to search in the past for similar days to a target day in order to infer the predictand of interest, such as daily precipitation. They can rely on outputs of numerical weather prediction (NWP) models in the context of operational forecasting or outputs of climate models in the context of climate impact studies. AMs require low computing capacity and have demonstrated useful potential for application in several contexts.
fr: :ref:`Les méthodes d'analogues (MAs) <analog-methods>` sont des méthodes statistiques de prévision météorologique, qui utilisent des prédicteurs à l'échelle synoptique pour rechercher dans le passé des jours similaires à un jour cible afin de déduire le prédictant d'intérêt, tel que les précipitations journalières. Elles peuvent s'appuyer sur les résultats des modèles de prévision numérique du temps (PNT) dans le contexte des prévisions opérationnelles ou sur les résultats des modèles climatiques dans le contexte des études d'impact du changement climatique. Les MAs requièrent une faible capacité de calcul et ont démontré un potentiel d'application utile dans plusieurs contextes.

source: AtmoSwing is open-source software written in C++ that implements AMs in a flexible way so that different variants can be handled dynamically. It comprises four modules: the Forecaster for use in operational forecasting, the Viewer to display the results, the Downscaler for climate studies, and the Optimizer to establish the relationship between predictands and predictors.
fr: AtmoSwing est un logiciel libre écrit en C++ qui met en œuvre les MAs de manière flexible permettant une gestion dynamique de différentes variantes. Il comprend quatre modules : le Forecaster pour les prévisions opérationnelles, le Viewer pour afficher les résultats, le Downscaler pour les études climatiques et l'Optimizer pour établir la relation statistique entre les prédictants et les prédicteurs.

source: :ref:`The Forecaster <app-forecaster>` handles every required processing internally, such as NWP output downloading (when possible) and reading as well as grid interpolation. No external scripts or file conversion are required. The processing of a forecast requires low computing efforts and can even run on a Raspberry Pi computer. It provides valuable results, as revealed by multiple years of operational precipitation forecasting in the Swiss Alps.
fr: :ref:`Le Forecaster <app-forecaster>` gère en interne toutes les opérations nécessaires, tels que le téléchargement (si possible) et la lecture des sorties des modèles PNT, ainsi que l'interpolation des grilles. Aucun script externe ou conversion de fichier n'est nécessaire. Le calcul d'une prévision nécessite peu de resources informatiques et peut même être exécuté sur un Raspberry Pi. Il fournit des résultats utiles, comme le montrent plusieurs années de prévision opérationnelle des précipitations dans les Alpes suisses.

source: :ref:`The Viewer <app-viewer>` displays the forecasts in an interactive GIS environment with several levels of synthesis and detail. This provides a quick overview of the potential critical situations in the upcoming days, as well as the possibility for the user to delve into the details of the forecasted predictand and criteria distributions.
fr: :ref:`Le Viewer <app-viewer>` affiche les prévisions dans un environnement SIG interactif avec plusieurs niveaux de synthèse et de détail. Il offre un aperçu rapide des situations critiques potentielles dans les jours à venir, ainsi que la possibilité pour l'utilisateur de se plonger dans les détails de la distribution des prédicteurs et des critères prévus.

source: :ref:`The Downscaler <app-downscaler>` allows for the use of AMs in a climatic context, either for climate reconstruction or for climate change impact studies. When used for future climate studies, it is necessary to pay close attention to the selected predictors so that they contain the climate change signal.
fr: :ref:`Le Downscaler <app-downscaler>` permet d'utiliser les MAs dans un contexte climatique, soit pour la reconstruction du climat, soit pour des études d'impact du changement climatique. Lorsqu'ils sont utilisés pour des études sur le climat futur, il est nécessaire de prêter une attention particulière aux prédicteurs sélectionnés afin qu'ils contiennent le signal du changement climatique.

source: :ref:`The Optimizer <app-optimizer>` implements different optimization techniques, such as a semiautomatic sequential approach, Monte Carlo simulations, and a global optimization technique using genetic algorithms. Establishing a statistical relationship between predictors and predictands is computationally intensive because it requires numerous assessments over decades. To this end, the code was highly optimized for computation efficiency, is parallelized (using multiple threads), and scales well on CPU or GPU clusters. This procedure is only required to establish the statistical relationship, which can then be used for forecasting or downscaling at a low computing cost.
fr: :ref:`L'Optimizer <app-optimizer>` met en œuvre différentes techniques d'optimisation, telles qu'une approche séquentielle semi-automatique, des simulations de Monte Carlo et une technique d'optimisation globale utilisant des algorithmes génétiques. L'établissement d'une relation statistique entre les prédicteurs et les prédictants est un calcul intensif car il nécessite de nombreuses évaluations sur plusieurs décennies. À cette fin, le code a été fortement optimisé, est parallélisé (utilisation de plusieurs threads) et s'adapte bien aux grappes de serveurs (clusters) CPU ou GPU. Cette procédure n'est nécessaire que pour établir la relation statistique, qui peut ensuite être utilisée pour la prévision ou la descente d'échelle (downscaling) à un faible coût de calcul.

source: **Reference article**: `Horton, P.: AtmoSwing: Analog Technique Model for Statistical Weather forecastING and downscalING (v2.1.0), Geosci. Model Dev., 12, 2915-2940, https://doi.org/10.5194/gmd-12-2915-2019, 2019 <https://www.geosci-model-dev.net/12/2915/2019/gmd-12-2915-2019.html>`_.
fr: **Article de référence** : `Horton, P.: AtmoSwing: Analog Technique Model for Statistical Weather forecastING and downscalING (v2.1.0), Geosci. Model Dev., 12, 2915-2940, https://doi.org/10.5194/gmd-12-2915-2019, 2019 <https://www.geosci-model-dev.net/12/2915/2019/gmd-12-2915-2019.html>`_.

source: Indices and tables
fr: Indices et tableaux
